[
    {
        "title": "devboard",
        "description": "Devboard is a modern, full-stack project management application built with Next.js 14 (using the Pages Router), TypeScript, and styled with MUI. Leveraging React Query for efficient data fetching and caching, Devboard aims to provide a streamlined workflow for managing projects, tasks, and team collaboration, exploring best practices in current web development technologies and architectural patterns.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a personal project built using TypeScript and JavaScript, focusing on exploring modern web development techniques. While further details about the specific purpose of Raven-v2 are unavailable without access to the README, it likely serves as a learning platform or a showcase of skills related to general project management and potentially front-end development practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern, full-stack web application built with Next.js, TypeScript, CSS, and JavaScript, designed to serve as a customizable and scalable dashboard template. This project aims to provide developers with a solid foundation for building complex user interfaces and data visualizations, incorporating best practices for performance, maintainability, and user experience. The repository showcases a practical implementation of modern web development principles and serves as a learning resource for developers interested in Next.js and dashboard development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface built with JavaScript, Python, HTML, and CSS, designed as a project to visualize and interact with data from Robofleet, a robotics fleet management system. This dashboard provides real-time monitoring, control interfaces, and data analysis tools for robotic fleets, enabling users to efficiently manage and optimize robot operations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This CRUD Expense Tracker, built with JavaScript, CSS, and HTML, utilizes Material-UI to provide a user-friendly interface for managing personal finances. The project allows users to create, read, update, and delete expense entries, offering a simple and effective way to track spending habits and budget effectively. It serves as a practical demonstration of CRUD operations and Material-UI component usage in a front-end web application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code and generated HTML output for my resume, showcasing a professional and easily customizable design. The project leverages TeX for elegant formatting and uses HTML for web-friendly accessibility. It serves as a template and a working example for creating and managing a modern, dynamic resume.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a project built with TypeScript, CSS, and JavaScript, designed to serve as a dynamic and collaborative platform for brainstorming and organizing ideas. This project allows users to easily capture, visualize, and prioritize concepts, facilitating more effective project planning and development workflows. The repository focuses on providing a simple yet powerful interface for managing and refining ideas within a team environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, HTML, and CSS to help users visualize and manage their sleep debt. This application allows users to log their sleep hours and track the difference between their ideal sleep schedule and actual sleep, providing a clear understanding of their accumulated sleep debt. Focusing on practical application and efficient code, this project serves as a demonstration of TypeScript usage in a front-end development context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a CRUD application built using Python and Flask, leveraging PostgreSQL for data storage. This project demonstrates a practical implementation of web application development principles, incorporating HTML, CSS, and Shell scripting for various aspects of the application, from the frontend interface to deployment and management. It serves as a valuable learning resource for those interested in full-stack Python development and working with relational databases.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project leveraging HTML and Python to create interactive and visually appealing maps. This repository focuses on implementing map-based visualizations, potentially for data analysis or presentation, utilizing open-source libraries and frameworks to represent geographical data effectively.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite.js, Express.js, HTML, CSS, and JavaScript that leverages the Gemini API to provide interactive AI-powered conversations. This project explores the integration of large language models into a modern web framework, demonstrating best practices in frontend and backend development with a focus on creating a seamless user experience for engaging with AI.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebooks and Python, contains a collection of projects focused on applying Python to financial analysis. It explores various aspects of finance through practical implementations, providing hands-on experience in areas like [insert specific areas mentioned in the README, e.g., portfolio optimization, time series analysis, or options pricing]. The goal is to demonstrate how Python can be used to solve real-world financial problems and gain valuable insights from data.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT asset tracking web application built with Next.js, TypeScript, and styled with Tailwind CSS. Utilizing Supabase for backend services and real-time data, the project provides a user-friendly interface for monitoring and managing the location and status of tracked assets. It serves as a practical example of leveraging cutting-edge technologies for building efficient and scalable IoT solutions.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-based project that creates a customizable and interactive event calendar using HTML and CSS for structure and styling. This repository provides a dynamic calendar solution, allowing users to easily display and manage events, focusing on front-end implementation and user interface design.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a web-based project built with TypeScript, JavaScript, HTML, and CSS, focused on [mention the specific purpose or functionality if discernible from the README or project name - e.g., exploring interactive maps, visualizing global data, etc.]. This repository contains the codebase for the project's front-end implementation and demonstrates the application of modern web development practices. The project aims to [mention the core goal or use case - e.g., provide an engaging user experience, offer a platform for data exploration, etc.].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files, providing a user-friendly interface to parse, filter, and understand ROS system behavior. Built with a combination of JavaScript, Python, HTML, and CSS for the front-end, and leveraging Python for back-end processing, this project aims to simplify debugging and performance analysis in ROS environments. It falls under the broader project category of tools designed to aid in ROS development and debugging.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-Voting is a modern, real-time voting application built with Next.js, TypeScript, CSS, and JavaScript, designed for streamlined project decision-making. This project leverages serverless functions and a dynamic frontend to provide a seamless and engaging voting experience. It focuses on simplicity and ease of use, making it ideal for quickly gauging opinions and reaching consensus within project teams.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a fully functional e-commerce platform built with Next.js 14 (utilizing the pages router), TypeScript, and MUI, showcasing modern web development practices. This project leverages React Query for efficient data fetching and management, providing a type-safe environment for selling and purchasing fruit. It serves as a practical example for learning and implementing e-commerce solutions with a focus on performance, maintainability, and a delightful user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]