[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface built with JavaScript, Python, HTML, and CSS for visualizing and interacting with data from the Robofleet robotics platform. This project provides a user-friendly dashboard for monitoring robot status, sensor data, and task progress, facilitating improved robot fleet management and operational awareness. Focused on practical applications within the robotics domain, it serves as a valuable tool for developers and operators working with Robofleet.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML to help users visualize and manage their sleep debt. This application allows users to log their sleep hours and track the difference between their target sleep duration and actual sleep, promoting better sleep habits and awareness of accumulated sleep debt. This project serves as a practical application of TypeScript and modern web development techniques, focusing on user-friendly data visualization and personal well-being.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the LaTeX source code and HTML output for my resume, showcasing my skills and experience. Built primarily with TeX for professional formatting and converted to HTML for web accessibility, this project serves as a dynamic and easily shareable representation of my professional profile.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack web application built with Next.js 14 (using the pages router), TypeScript, and Material UI (MUI) showcasing modern web development best practices. This project leverages React Query for efficient data fetching and caching, demonstrating a practical application architecture suitable for building complex, data-driven user interfaces. It explores key concepts like component-based design, API route handling, and type-safe development within the Next.js ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains projects focused on applying Python to financial analysis and modeling. It explores various aspects of finance through practical examples and code, making it a useful resource for learning how to leverage Python for financial data analysis, portfolio management, and other finance-related tasks.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project built with TypeScript, CSS, and JavaScript that serves as a dynamic and visual platform for brainstorming and organizing ideas. This Next.js application allows users to create and arrange virtual sticky notes, fostering a space for collaborative idea generation, project planning, and visual organization. The project aims to provide a user-friendly and intuitive experience for teams to capture, develop, and prioritize their concepts within a shareable, interactive environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-Event-Calendar is a JavaScript-based project for creating interactive and customizable event calendars on web pages. Built with HTML, CSS, and JavaScript, this repository provides a functional and visually appealing event calendar component that allows users to dynamically add, view, and manage events. The project focuses on delivering a flexible solution for event scheduling and display within web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "iot-asset-tracking is a full-stack web application built with Next.js, TypeScript, and Tailwind CSS, designed to provide real-time asset tracking capabilities. Leveraging Supabase for backend services and database management, this project showcases a modern approach to IoT data visualization and management, focusing on a user-friendly interface and efficient data handling. It serves as a practical example of building data-driven applications with a performant and scalable architecture.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a dynamic voting application built using Next.js, TypeScript, CSS, and JavaScript. This project explores modern web development techniques and offers a user-friendly interface for creating and participating in polls. The repository showcases a practical implementation of web application development using a cutting-edge tech stack.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project built with TypeScript, CSS, JavaScript, HTML, Express.js, and Vite.js, leveraging the Gemini API to create a conversational AI experience. This repository showcases a practical application of modern web development technologies combined with a cutting-edge AI model for engaging user interactions.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "Ros-log-viewer is a web-based tool, built with JavaScript, Python, HTML, CSS, and Shell scripting, designed to visualize and analyze ROS (Robot Operating System) log files. This project provides a user-friendly interface for filtering, searching, and interpreting ROS log data, making it easier to debug and understand robot behavior. It focuses on streamlining the ROS development workflow by offering an efficient way to examine and gain insights from complex log outputs.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built using Next.js, TypeScript, CSS, and JavaScript. This repository serves as a practical example for implementing common dashboard features and UI components with a focus on leveraging Next.js's powerful features for efficient development and optimized performance. It's designed as a learning resource and a starting point for building custom dashboard applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a personal project built using TypeScript and JavaScript, exploring modern web development practices. This repository serves as a playground for experimenting with different architectures and technologies, showcasing a practical application of project-based learning and offering a glimpse into a personal development journey.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project leveraging HTML and Python to create dynamic and interactive map visualizations. This repository focuses on exploring and implementing techniques for presenting geographical data in a user-friendly and informative manner, providing a foundation for visualizing spatial information and trends.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting. This project demonstrates the creation of a dynamic web application with features for creating, reading, updating, and deleting data using a robust backend and a user-friendly interface, serving as a practical example for learning web development with Python.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a web-based project built with TypeScript, JavaScript, HTML, and CSS, exploring interactive and engaging user experiences. This repository contains the code for a project focused on [**Insert purpose from README - e.g., visualizing global data, creating a virtual world exploration tool, etc.**], aiming to provide a dynamic and accessible platform for [**Insert target audience/use case from README - e.g., data analysis, educational purposes, user entertainment, etc.**].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a full-stack e-commerce project built with Next.js 14 (using the pages router), TypeScript, and React, focusing on providing a seamless online shopping experience for fresh produce. The application leverages Material UI (MUI) for a responsive and intuitive user interface, React Query for efficient data fetching and caching, and emphasizes type safety throughout the codebase to ensure maintainability and scalability. This project showcases best practices in modern web development and serves as a learning resource for building robust e-commerce platforms.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]