[
    {
        "title": "sleep-debt-tracker",
        "description": "The Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt. This application allows users to track their sleep patterns, calculate their sleep debt based on their sleep goals, and provides insights for improving their sleep habits. The project serves as a practical demonstration of TypeScript and modern web development principles, focusing on creating a user-friendly interface for tracking personal sleep data.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository hosts my resume project, built using LaTeX for print-ready formatting and HTML for a web-based version. It showcases my skills and experience in a visually appealing and accessible format, serving as a central location for both downloadable and online presentations of my professional profile.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack web application built with Next.js 14 (Pages Router), TypeScript, and Material UI (MUI) to serve as a project management and organizational tool. Utilizing React Query for efficient data fetching and management, this project demonstrates a robust architecture for creating dynamic and interactive user interfaces with a focus on clean, maintainable code and modern web development best practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack, web-based voting application built with Next.js, TypeScript, CSS, and JavaScript. This project provides a secure and user-friendly platform for creating and participating in polls, focusing on a clean design and responsive user experience. It showcases best practices in modern web development and serves as a demonstration of project development skills.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a JavaScript, CSS, and HTML-based project focused on creating a visually appealing and interactive event calendar. This repository provides a foundation for building a customizable calendar solution where event data can be dynamically loaded and displayed, offering users an intuitive way to view and manage scheduled activities.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT asset tracking web application built with Next.js, TypeScript, Tailwind CSS, and Supabase. It provides a user-friendly interface to monitor and manage the location and status of assets in real-time, leveraging the power of Supabase for backend data storage and authentication. This project showcases a practical implementation of IoT concepts and demonstrates a full-stack development approach using cutting-edge technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface for monitoring and controlling fleets of robots, built using JavaScript, Python, HTML, and CSS. This project provides a user-friendly dashboard to visualize robot telemetry, manage tasks, and gain insights into robot performance within the Robofleet ecosystem. It serves as a central point for interacting with and managing robotic deployments, falling under the broader category of robotics projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting designed for visualizing and analyzing ROS (Robot Operating System) log files. This project provides a user-friendly interface to efficiently parse, filter, and display ROS log data, making it easier for developers to debug and understand the behavior of their ROS-based robotic systems. It aims to streamline the log analysis workflow and improve the overall development experience within the ROS ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Jupyter Notebooks and Python scripts focused on applying Python to various financial analysis and modeling tasks. Explore projects covering topics such as stock price prediction, portfolio optimization, risk management, and more, all using popular Python libraries for data manipulation and financial analysis. This is a hands-on resource for learning how to leverage Python's capabilities in the realm of finance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-idea-board",
        "description": "Next-Idea-Board is a project built with TypeScript, CSS, and JavaScript, designed as a dynamic idea management tool. This repository houses the code for a visual board that allows users to brainstorm, organize, and prioritize project ideas in a collaborative and intuitive manner. It leverages modern web development practices to provide a seamless user experience and efficient workflow for project development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project demonstrating a modern, responsive dashboard application built with Next.js, TypeScript, CSS, and JavaScript. This repository serves as a practical example for implementing dynamic user interfaces and interactive data visualization within a Next.js framework, focusing on project-based learning and showcasing best practices for front-end development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring modern web development techniques, built with TypeScript and JavaScript. This repository serves as a learning platform and a demonstration of best practices in front-end architecture and development, focusing on efficient and maintainable code.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository, built with HTML and Python, houses a project focused on map visualization. It leverages these technologies to create interactive and informative maps, potentially for displaying geographical data, analyzing spatial patterns, or providing location-based services. This project explores techniques for visualizing data on maps and offers a practical implementation of geographical data representation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a CRUD application built using Python's Flask framework, leveraging a PostgreSQL database for data persistence and styled with HTML, CSS, and shell scripting for deployment. This project demonstrates a functional web application encompassing database interaction, user interface design, and basic deployment strategies, making it a useful example for learning practical Python web development and related technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project showcasing interactive maps and geographic data visualization, built using TypeScript, JavaScript, HTML, and CSS. This repository explores dynamic map implementations and data integration to create engaging web-based geographic experiences.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, utilizing Express.js and Vite.js for the backend and frontend respectively, to provide a platform powered by the Gemini API. This project demonstrates a practical application of modern web technologies, allowing users to interact with the Gemini AI model through a clean and responsive HTML and CSS interface, showcasing a real-world implementation of AI integration in a web environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a modern e-commerce platform built with Next.js 14, leveraging TypeScript, React Query for efficient data fetching, and MUI for a polished user interface. This project, structured with the Pages Router, demonstrates best practices for building type-safe and performant online storefronts. It focuses on providing a seamless fruit buying experience, while showcasing current web development technologies and architectural patterns within the e-commerce domain.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]