[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS, designed as a project showcasing interactive data visualization and monitoring capabilities. This dashboard likely integrates with the Robofleet robotics platform, providing users with real-time insights into robot performance, sensor data, and system status through dynamic charts and user-friendly controls.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, written in TeX and rendered as a polished PDF document, alongside an HTML version for online accessibility. It serves as a showcase of my skills and experience, demonstrating proficiency in document formatting with TeX and web development with HTML, acting as a personal project to present my professional profile.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a responsive and interactive dashboard built using Next.js, TypeScript, CSS, and JavaScript. This repository serves as a practical example of implementing a modern web application with a focus on efficient data visualization and user interface design, demonstrating best practices in front-end development and project structure.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built with TypeScript and JavaScript, focusing on [Add a brief, specific purpose based on the README if available, e.g., \"creating a real-time chat application\" or \"providing a streamlined note-taking experience\"]. This repository showcases [mention key functionalities or features, e.g., \"a modern UI with a robust backend\" or \"an intuitive user interface and powerful API integration\"]. It demonstrates practical application of [mention specific technologies or design patterns used, e.g., \"React, Node.js, and RESTful API principles\" or \"state management with Redux and server-side rendering\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and shell scripting, it provides an intuitive interface for filtering, searching, and exploring log data to debug and monitor ROS-based robotic systems, serving as a useful project for anyone working with ROS development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (using the Pages Router), TypeScript, and Material UI (MUI) to serve as a customizable developer dashboard. It leverages React Query for efficient data fetching and management, offering a structured environment for organizing projects, tracking progress, and managing resources. This repository showcases modern web development practices and provides a template for creating personalized dashboards with a focus on performance and maintainability.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "The dynamic-event-calendar repository showcases a project built using JavaScript, CSS, and HTML to create an interactive and customizable event calendar. This project allows users to dynamically add, view, and manage events within a visually appealing calendar interface, offering a flexible solution for scheduling and event management applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "iot-asset-tracking is a Next.js project built with TypeScript, Tailwind CSS, and Supabase, designed to provide a streamlined solution for managing and tracking IoT assets. Utilizing modern web technologies, this application offers a user-friendly interface to monitor asset locations and status, leveraging Supabase for backend functionalities such as data storage and authentication. This repository showcases a practical implementation of TypeScript-based frontend development combined with serverless backend capabilities for efficient IoT asset management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built using TypeScript, JavaScript, HTML, and CSS to help users visualize and manage their sleep debt.  This application allows users to track their sleep patterns, calculate their sleep debt, and provides a clear, visual representation of their sleep health. It serves as a practical application of TypeScript principles and demonstrates a structured approach to building a user-friendly data tracking tool.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Python-based Jupyter Notebook projects focused on applying financial analysis and modeling techniques. Utilizing Python's powerful libraries, the projects explore various finance topics, offering practical examples and implementations for learning and experimentation in areas like portfolio optimization, risk management, and financial forecasting.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript, functioning as a dynamic and collaborative platform for brainstorming and organizing ideas. This interactive idea board allows users to seamlessly create, categorize, and prioritize ideas, fostering a productive environment for project planning and development. It leverages modern web technologies to deliver a responsive and user-friendly experience, facilitating efficient collaboration and idea management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a dynamic web application built with TypeScript, Vite.js, and Express.js, leveraging the Gemini API to provide users with an interactive AI conversation experience. This project showcases a modern full-stack architecture, combining frontend technologies like HTML, CSS, and JavaScript with a robust backend for seamless communication with the Gemini API and efficient data handling. It serves as a practical example of integrating AI capabilities into web applications and demonstrates best practices in TypeScript-based development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js (TypeScript, JavaScript) and styled with CSS, designed to facilitate simple and efficient voting processes. This project leverages modern web development practices to provide a user-friendly interface for creating and participating in polls, showcasing a practical application of Next.js within the broader context of web development projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project leveraging HTML and Python to create interactive and insightful map visualizations. This repository showcases the development process of building a dynamic mapping application, exploring techniques for data overlay and geographic representation. It serves as a learning resource for anyone interested in combining web technologies and data science to build engaging geographical data visualizations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a Python-based CRUD application built with Flask, PostgreSQL, HTML, CSS, and shell scripting, providing a project template for creating and managing data. This repository showcases a practical example of building a web application with common technologies, covering topics such as database interaction, web development with Flask, and basic user interface design.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project built using TypeScript, JavaScript, HTML, and CSS, aiming to [mention the project's primary goal or purpose - e.g., showcase interactive globe visualizations, provide a platform for global data exploration, etc.]. This repository encompasses [mention specific features or areas of focus - e.g., dynamic data rendering, user-friendly interface elements, etc.] related to the broader topic of projects and serves as a practical demonstration of modern web development technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce web application built with Next.js 14 (using the pages router), TypeScript, and React. This project showcases a modern approach to online shopping, utilizing MUI for a clean and responsive UI, and leveraging React Query for efficient data fetching and caching. It's a practical example of building an e-commerce platform with type safety and best practices, focusing on selling fruits online.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]