[
  {
      "title": "NextJs-Dashboard",
      "description": "NextJs-Dashboard is a project-based repository showcasing a modern, responsive dashboard built using Next.js, TypeScript, CSS, and JavaScript. It demonstrates best practices for front-end development with Next.js, including data fetching, component architecture, and styling solutions, serving as a practical example for learning and implementing similar dashboard applications.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
      "liveLink": "https://aayushsiwa-dashboard.vercel.app"
  },
  {
      "title": "next-voting",
      "description": "Next-voting is a project exploring decentralized voting solutions built with TypeScript, CSS, and JavaScript. It aims to provide a secure and transparent platform for various voting scenarios, leveraging modern web technologies to create a user-friendly and accessible voting experience. The repository contains the source code and related resources for this voting platform.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/next-voting",
      "liveLink": "https://next-voting.vercel.app"
  },
  {
      "title": "resume",
      "description": "This repository contains the TeX source code for my resume. It's a personal project demonstrating my typesetting skills and provides a customizable template for creating professional-looking resumes using LaTeX. The primary topics covered are document creation and formatting using the TeX language.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/resume",
      "liveLink": ""
  },
  {
      "title": "finance-with-python",
      "description": "This repository, built using Jupyter Notebook and Python, contains projects focused on practical financial analysis and modeling. It explores key concepts in finance through hands-on exercises and code examples, providing a resource for learning and applying Python to real-world financial problems.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/finance-with-python",
      "liveLink": "https://py-finance.streamlit.app/"
  },
  {
      "title": "genietalks",
      "description": "GenieTalks is a project built with TypeScript, Vite.js, Express.js, CSS, HTML, and JavaScript, exploring integration with the Gemini API to create a platform for interactive and intelligent conversations. This repository showcases a practical application of modern web technologies combined with AI capabilities for building a dynamic and engaging project.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/genietalks",
      "liveLink": "https://genietalks.vercel.app"
  },
  {
      "title": "robofleet-dashboard",
      "description": "Robofleet-dashboard is a web-based interface developed using JavaScript, Python, HTML, and CSS, designed to visualize and interact with data from the Robofleet robotics platform. This project provides real-time monitoring, data analysis, and control capabilities for robotic fleets, offering a comprehensive solution for managing and understanding robot performance and operations. It serves as a central hub for Robofleet users to gain insights and manage their robotics deployments.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
      "liveLink": "https://robofleet-dashboard.vercel.app"
  },
  {
      "title": "atg-world",
      "description": "The atg-world repository houses a project built using TypeScript, JavaScript, HTML, and CSS. This project, focusing on [mention specific aim of project if known, otherwise use a general term like \"web development\" or \"frontend development\"], explores [mention specific aspect of the topic 'project', e.g., \"interactive maps,\" \"data visualization,\" \"user interfaces\"].\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/atg-world",
      "liveLink": "https://atg-world-as.vercel.app"
  },
  {
      "title": "iot-asset-tracking",
      "description": "iot-asset-tracking is a web application built with Next.js, TypeScript, TailwindCSS, and Supabase, designed for real-time tracking and management of IoT assets. This project provides a user-friendly interface for monitoring device locations and status, leveraging Supabase for data storage and authentication, and utilizing TypeScript for maintainable and scalable code.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
      "liveLink": "https://iot-asset-tracking.vercel.app"
  },
  {
      "title": "ros-log-viewer",
      "description": "`ros-log-viewer` is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built using JavaScript, Python, HTML, CSS, and Shell scripts, it provides a user-friendly interface to parse, filter, and interpret ROS log data, aiding in debugging and understanding robot behavior. This project focuses on providing efficient log analysis and falls under the broad topic of project development.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
      "liveLink": "https://ros-log-viewer-as.vercel.app"
  },
  {
      "title": "dynamic-event-calendar",
      "description": "Dynamic-Event-Calendar is a JavaScript, CSS, and HTML project designed to create a visually appealing and interactive calendar that can dynamically display and manage events. This project focuses on providing a user-friendly interface for scheduling and viewing events, making it a valuable tool for personal organization or integrating into larger web applications requiring event management functionality.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
      "liveLink": "https://calendar-as.vercel.app"
  },
  {
      "title": "Map-Visualisation",
      "description": "Map-Visualisation is a project leveraging HTML and Python to create interactive map visualizations. This repository contains the code and resources for generating dynamic and informative maps, suitable for exploring geographical data and showcasing spatial relationships. The project focuses on practical application of map visualization techniques.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
      "liveLink": "https://map-vis.streamlit.app/"
  },
  {
      "title": "next-idea-board",
      "description": "Next-Idea-Board is a project management tool built using TypeScript, CSS, and JavaScript. This repository provides a flexible and collaborative platform for brainstorming, organizing, and prioritizing ideas, helping teams visualize and track their progress from initial concept to actionable tasks.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/next-idea-board",
      "liveLink": "https://next-idea-board.vercel.app"
  },
  {
      "title": "jovian",
      "description": "The jovian repository hosts a CRUD application built with Python and the Flask framework, utilizing PostgreSQL for data storage. This project demonstrates the implementation of basic create, read, update, and delete operations, showcasing web development principles with technologies including HTML, CSS, and Shell scripts for deployment and management. It serves as a practical example of a Python-based web application using Flask and PostgreSQL.\n",
      "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
      "githubLink": "https://github.com/aayushsiwa/jovian",
      "liveLink": "https://jovian-alpha.vercel.app"
  }
]