[
    {
        "title": "devboard",
        "description": "Devboard is a comprehensive project template built with Next.js 14 (pages router), TypeScript, and Material UI (MUI) to provide a solid foundation for modern web applications. This repository showcases best practices for structuring a Next.js project, incorporating React Query for efficient data fetching and caching, and utilizing TypeScript for enhanced type safety and code maintainability, making it ideal for learning and jumpstarting new development initiatives.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface, built with JavaScript, Python (likely for backend services), HTML, and CSS, designed for project visualization and control related to Robofleet. This dashboard aims to provide a user-friendly platform for monitoring and interacting with robot fleets and associated data streams.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This CRUD Expense Tracker is a simple web application built with JavaScript, CSS, and HTML, leveraging Material-UI for a clean and responsive user interface. It allows users to easily add, read, update, and delete expense entries, providing a basic framework for personal finance management. This project demonstrates fundamental CRUD operations and UI design principles, serving as a practical learning tool and a starting point for building more complex financial applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project showcasing modern web development techniques using TypeScript and JavaScript. This repository explores various aspects of project development, focusing on creating a robust and maintainable application architecture. It serves as a learning resource and a practical demonstration of leveraging TypeScript for enhanced code quality and utilizing modern JavaScript frameworks for building interactive user interfaces.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern, responsive dashboard project built with Next.js, TypeScript, CSS, and JavaScript. It demonstrates best practices for structuring a Next.js application, incorporating server components, data fetching, and UI design principles to create an interactive and visually appealing user interface. This project serves as a practical learning resource for developers looking to build scalable and performant web applications with Next.js.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt. This tool allows users to log their sleep schedule and track the difference between their target and actual sleep hours, offering a visual representation of their sleep patterns. The repository showcases the application of TypeScript in a practical project.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript, designed as a dynamic and collaborative platform for brainstorming and organizing ideas. This interactive board allows users to visually manage concepts, prioritize tasks, and track progress, making it an ideal tool for project planning, team collaboration, and personal organization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for a professional and customizable layout. The final resume is also available in HTML format for easy online sharing and accessibility. This project serves as a practical example of using LaTeX for document creation and showcases my skills in typesetting and web development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js, TypeScript, CSS, and JavaScript that enables users to create and participate in various types of polls and voting events. Focused on simplicity and user experience, this project provides a platform for creating customizable polls with different voting options and real-time result tracking.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, and PostgreSQL, utilizing HTML, CSS, and Shell scripting for a complete web-based project. This repository showcases the implementation of essential Create, Read, Update, and Delete functionalities, serving as a practical demonstration of building a robust and interactive web application using a popular Python framework and a relational database.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project focused on creating interactive and dynamic map visualizations using HTML for the front-end and Python for backend data processing and manipulation. This repository showcases techniques for displaying geographical data and insights effectively through web-based mapping interfaces. It explores various mapping libraries and data visualization methods to present location-based information in an engaging and understandable manner.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite, Express.js, HTML, CSS, and JavaScript, leveraging the Gemini API to provide users with an engaging AI-powered conversational experience. This project demonstrates a practical implementation of AI interaction within a modern web framework, exploring key topics like API integration and frontend/backend communication using cutting-edge technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, houses a project focused on applying Python for financial analysis and modeling. It explores various finance-related topics, likely including data analysis, visualization, and potentially algorithmic trading or portfolio management, providing practical examples and demonstrations within the Jupyter Notebook environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a web-based project built with TypeScript, JavaScript, HTML, and CSS. This repository focuses on [mention the project's main goal or purpose, drawing inspiration from the README if possible. For example: \"creating an interactive world map,\" or \"developing a dynamic data visualization tool,\" or \"building a personal portfolio website\"]. It explores topics in project development and demonstrates practical application of modern web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a modern web application built with Next.js, TypeScript, and Tailwind CSS for tracking IoT assets in real-time. Utilizing Supabase for backend services, the project showcases a clean and intuitive interface for monitoring and managing asset location data, providing a comprehensive solution for IoT asset management and serving as a practical example of a full-stack TypeScript project.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-based project showcasing a customizable and interactive event calendar built with HTML, CSS, and JavaScript. This repository provides a functional and visually appealing calendar interface, allowing users to dynamically manage and display events, serving as a useful template or starting point for calendar integration within web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files, offering a user-friendly interface to parse, filter, and explore log data. Built using JavaScript, Python, HTML, CSS, and shell scripting, this project provides developers with a powerful way to debug and understand the behavior of their ROS systems. It focuses on improving the development workflow within ROS by facilitating efficient log analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a Next.js 14 e-commerce project built with TypeScript, utilizing MUI for the UI and React Query for efficient data fetching. This repository showcases a basic online fruit store implementation using the pages router and demonstrates best practices for type safety and modern front-end development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]