[
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (Pages Router), TypeScript, and Material UI (MUI), designed as a customizable developer dashboard. This repository leverages React Query for efficient data fetching and management, providing a foundation for organizing projects, tracking progress, and accessing essential development resources. It serves as a practical example of integrating modern web technologies to create a personalized and productive workspace for developers.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-Dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS, designed to visualize and interact with data from a Robofleet robotic fleet. This project focuses on providing a user-friendly dashboard for monitoring robot status, managing tasks, and gaining insights into fleet performance, aligning with key topics in robotic fleet management and project development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "crud-expense-tracker is a simple web application built with JavaScript, CSS, and HTML for managing personal finances. It provides a user-friendly interface, powered by Material-UI, to create, read, update, and delete (CRUD) expense entries. This project serves as a practical example of implementing basic CRUD operations in a front-end web application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, and PostgreSQL, providing a user-friendly interface for managing data. This project utilizes HTML, CSS, and Shell scripting to create a robust and interactive web application, demonstrating practical implementation of fundamental web development principles and backend database integration. It serves as a valuable learning resource for individuals interested in building Python-based web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository showcases a project focused on map visualization, leveraging HTML for the front-end interface and Python for backend data processing and potentially map generation. It provides a visual representation of data overlaid on a map, offering insights and analysis through interactive elements and geographic context. This project demonstrates skills in web development, data visualization, and potentially geospatial analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring modern web development techniques, built using TypeScript and JavaScript. This repository showcases a [mention the core purpose if available in the README, e.g., \"reactive front-end framework,\" \"full-stack application,\" or \"collection of UI components\"]. It serves as a learning resource and a practical demonstration of applying best practices in project architecture and code management within a web development context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It demonstrates best practices for structuring Next.js applications, implementing user interfaces, and handling data within a dashboard environment, offering a practical example for developers looking to build similar web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the LaTeX source code for my resume, along with an HTML version generated from it. It serves as a project showcasing my skills in document preparation using TeX, and demonstrates the ability to create web-friendly representations of professional documents. This project falls under the resume and personal portfolio topics.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built using TypeScript, JavaScript, HTML, and CSS to help users visualize and manage their sleep debt. This application allows users to track their sleep patterns, calculate their sleep debt, and provides insights into achieving a more consistent and healthy sleep schedule. The project serves as a practical demonstration of TypeScript and modern web development practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a project management tool built with TypeScript, CSS, and JavaScript, designed to help users organize and track their ideas and projects through a visual and intuitive Kanban-style board. Leveraging modern web development practices, this repository provides a foundation for managing workflow and fostering collaboration within a project team or for individual task management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js, TypeScript, CSS, and JavaScript, designed to facilitate simple and efficient online voting. This project provides a user-friendly interface for creating and participating in polls, focusing on ease of use and accessibility for various voting scenarios. It showcases modern web development practices and serves as a practical example of a complete project using the specified technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern web application built with Next.js, TypeScript, and Tailwind CSS for tracking IoT assets. Utilizing Supabase for backend services, this project provides a user-friendly interface for managing and monitoring assets, demonstrating a practical application of cutting-edge web development technologies in the IoT space.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "The `dynamic-event-calendar` repository houses a project built with JavaScript, CSS, and HTML, creating a dynamic and interactive event calendar. This calendar aims to provide a user-friendly interface for managing and displaying events, focusing on a visually appealing and responsive design. It serves as a practical example of front-end development principles and provides a customizable foundation for event scheduling applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project built with TypeScript, Vite, Express.js, and leveraging the Gemini API, providing a platform for [Insert Purpose - e.g., interactive AI conversations, generating creative content, learning about AI models]. The frontend utilizes modern JavaScript, HTML, and CSS for a responsive user interface, while the backend is powered by Express.js for handling API requests and interacting with the Gemini API for [Specify Interaction - e.g., generating responses, processing user input].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, `finance-with-python`, contains a collection of Jupyter Notebook projects exploring financial concepts and data analysis using Python. Focusing on practical application, it covers various finance-related topics, demonstrating how to leverage Python libraries and techniques for financial modeling, analysis, and visualization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool designed for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and Shell scripting, it provides an intuitive interface to parse, filter, and display ROS log data, facilitating easier debugging and understanding of ROS system behavior, contributing to project maintainability and development efficiency.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a web-based project built with TypeScript, JavaScript, HTML, and CSS, focused on [mention the project's main purpose/functionality as described in the README, e.g., showcasing a dynamic world map, providing a platform for connecting travelers, or simulating real-world data]. This repository contains the source code for [mention a key feature if notable, e.g., the interactive map component or the user authentication system] and serves as a demonstration of modern web development techniques using a project-based learning approach.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a modern e-commerce web application built with Next.js 14 (using the Pages Router), TypeScript, and React, showcasing a user-friendly interface powered by Material UI (MUI). This project leverages React Query for efficient data fetching and management, ensuring a smooth and responsive shopping experience for users looking to purchase fresh fruits. It serves as a practical example of building a type-safe and performant e-commerce platform using cutting-edge web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]