[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository provides a web-based interface for monitoring and controlling robotic fleets, built using JavaScript, Python, HTML, and CSS. This project aims to offer real-time insights into robot status, performance metrics, and task management, allowing users to effectively manage and coordinate their robotic resources. It's designed as a central hub for interacting with and visualizing data from a Robofleet system, falling under the project topic category.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for precise formatting and potentially outputting to HTML. It serves as a project demonstrating my skills in document creation and web development technologies. This project is mainly focused on presentation and maintainability of a clean and professional resume.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. This repository provides a practical example of building a data-rich user interface with features like dynamic routing, server-side rendering, and component-based architecture, making it a valuable resource for developers learning or implementing Next.js in their projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring [mention the project's purpose, e.g., real-time communication, data visualization, etc.]. Built using TypeScript and JavaScript, this repository leverages modern web development practices to create [mention the project's main feature, e.g., a scalable chat application, an interactive dashboard, etc.]. Explore the codebase to learn more about [mention specific topics covered, e.g., efficient state management, responsive UI design, etc.].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML to help users monitor and manage their sleep debt. This application allows individuals to track their daily sleep hours against their ideal sleep schedule, visualizing their sleep deficit or surplus over time. Focusing on providing a user-friendly interface and leveraging modern web technologies, this project aims to improve sleep habits and overall well-being.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "devboard",
        "description": "DevBoard is a personal project built with Next.js 14 (using the Pages Router), TypeScript, and MUI, showcasing a customizable dashboard interface. It leverages React Query for efficient data fetching and management, offering a practical example of modern web development practices and serving as a learning resource for utilizing these technologies together in a real-world application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project implementing a responsive and interactive event calendar using JavaScript, CSS, and HTML.  This repository provides a functional calendar interface where users can dynamically add, view, and manage events, offering a practical demonstration of front-end web development principles and techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a Next.js-based IoT asset tracking application built with TypeScript, Tailwind CSS, and Supabase. It provides a user-friendly interface for monitoring and managing the location and status of assets, leveraging real-time data and modern web development practices. The project explores concepts in IoT data visualization and management within a scalable and responsive web application framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool, built using JavaScript, Python, HTML, CSS, and Shell scripting, designed to efficiently parse and visualize ROS (Robot Operating System) log files. This project provides a user-friendly interface for analyzing ROS logs, aiding in debugging and understanding robot behavior, and is a valuable asset for ROS developers looking for enhanced log analysis capabilities.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Jupyter Notebooks written in Python for exploring various concepts and applications in finance. It serves as a project-based learning resource, demonstrating how Python can be used for financial analysis, data visualization, and potentially algorithmic trading strategies. The notebooks cover topics ranging from basic financial calculations to more advanced modeling techniques, providing practical examples for learners and practitioners interested in using Python for finance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript that serves as a dynamic and collaborative platform for brainstorming and organizing ideas. Leveraging modern web development technologies, this interactive idea board allows users to easily add, categorize, and prioritize ideas, fostering a creative and productive environment for project planning and team collaboration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite.js, and Express.js to provide engaging and interactive discussions powered by the Gemini API. This project leverages modern web development technologies to explore and showcase the capabilities of AI-driven conversations, focusing on creating a seamless and insightful user experience through well-structured front-end and back-end implementations using HTML, CSS, JavaScript, and TypeScript.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository contains a project focused on creating interactive map visualizations using HTML for the front-end interface and Python for data processing and backend functionality. It demonstrates techniques for displaying geographical data and creating engaging visual representations on a map, showcasing skills in data visualization and web development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, and PostgreSQL, utilizing HTML, CSS, and Shell scripting for deployment. This project demonstrates the creation of a dynamic web application featuring Create, Read, Update, and Delete operations, providing a practical example of integrating a Python backend with a relational database and a responsive frontend.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack voting application built with Next.js (TypeScript, JavaScript, CSS) that allows users to create and participate in polls. This project focuses on delivering a smooth and intuitive voting experience, leveraging modern web technologies to provide a robust and engaging platform for opinion gathering and decision-making. It showcases best practices in project organization and implementation within the Next.js ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project showcasing a dynamic and interactive web application built with TypeScript, JavaScript, HTML, and CSS. This repository implements front-end functionalities and focuses on user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a modern e-commerce web application built with Next.js 14 (using the Pages Router), TypeScript, and React. Leveraging MUI for a polished user interface and React Query for efficient data fetching, this project demonstrates a robust and type-safe approach to building a scalable online marketplace. It showcases best practices in e-commerce development, covering key areas such as product listing, shopping cart functionality, and user authentication.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]