[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, HTML, and CSS, designed to help users monitor and manage their sleep debt. This application tracks sleep patterns, calculates accumulated sleep debt, and offers insights to promote better sleep habits, providing a simple and effective way to understand and address sleep deprivation. This project serves as a practical demonstration of TypeScript in a real-world application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the LaTeX source code for my resume, built with TeX for professional formatting and potentially compiled into a web-friendly HTML version. It serves as a project showcasing my resume design and demonstrating skills in document preparation and web presentation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-Dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS, designed to provide a comprehensive view and control panel for Robofleet, a robotics fleet management system. This project allows users to monitor robot status, manage tasks, and visualize data in real-time, facilitating efficient robot operation and management within a Robofleet ecosystem. As a key project, it streamlines interaction with and oversight of robotic fleets.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It serves as a learning resource and a foundation for creating robust and visually appealing web applications, demonstrating best practices for structuring Next.js projects and implementing common dashboard features.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven v2 is a project built with TypeScript and JavaScript, focusing on [Insert the project's core purpose or functionality, e.g., \"building a fast and efficient note-taking application\" or \"exploring modern web development techniques\"]. This repository showcases [Mention key features or goals, e.g., \"a clean and intuitive user interface\" or \"implementation of state-of-the-art performance optimizations\"], making it a valuable resource for developers interested in [Mention target audience or learning opportunities, e.g., \"learning modern web development practices\" or \"contributing to a collaborative open-source project\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a project built using JavaScript, CSS, and HTML that provides a customizable and interactive event calendar. This repository houses the code for a web-based calendar application designed to dynamically display and manage events, offering a user-friendly interface for scheduling and viewing important dates. It's a practical implementation showcasing front-end web development skills and calendar management principles.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT asset tracking web application built with Next.js, TypeScript, and styled with Tailwind CSS. It leverages Supabase for backend services, providing a robust and scalable solution for managing and monitoring the location and status of various assets. This project demonstrates best practices in modern web development and explores key concepts related to IoT data visualization and management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files, providing a user-friendly interface to filter, search, and understand ROS system behavior. Built using JavaScript, Python, HTML, CSS, and Shell scripting, this project aims to streamline the debugging process for ROS developers by offering a clear and intuitive way to interpret log data, making it easier to identify and resolve issues within their robotic systems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a web application built with TypeScript, Vite.js, and Express.js to facilitate interactive conversations powered by the Gemini API. This project explores integrating AI-driven dialogue within a modern web framework, offering a streamlined experience for users to engage in insightful discussions and explore the capabilities of large language models, all while leveraging modern web development practices and technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (using the Pages Router), TypeScript, and Material UI (MUI), designed to serve as a personal developer dashboard or portfolio. Leveraging React Query for efficient data fetching and management, this project showcases a clean and responsive user interface while providing a foundation for developers to manage and display their projects, skills, and other relevant information.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository hosts a project focused on map visualization, built using HTML for the front-end and Python for data processing and potentially backend logic. It leverages web-based technologies to display and interact with geographical data, offering a visual representation of location-based information.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a web application built with Python, Flask, and PostgreSQL, showcasing CRUD (Create, Read, Update, Delete) operations. This project serves as a practical demonstration of building a full-stack application, utilizing HTML, CSS, and Shell scripting alongside backend technologies. It offers a clear example of implementing common data management functionalities within a modern web framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript, designed to provide a collaborative space for brainstorming and organizing ideas. This interactive idea board allows users to easily add, categorize, and prioritize their thoughts, fostering a dynamic environment for project planning and creative problem-solving. Perfect for teams and individuals alike, it leverages modern web technologies to streamline the idea generation process.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack voting application built with Next.js, TypeScript, CSS, and JavaScript, designed as a project to explore modern web development practices. It allows users to create, participate in, and manage voting polls, leveraging the power of Next.js for server-side rendering and API routing. This repository serves as a practical example of building a dynamic web application from scratch, covering topics such as user authentication (if implemented), data management, and front-end interactivity.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, serves as a practical introduction to financial analysis and modeling. It explores various finance-related topics through hands-on projects, offering a learning resource for individuals interested in applying Python to real-world financial problems and gaining a deeper understanding of financial concepts.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a web-based project built using TypeScript, JavaScript, HTML, and CSS. It aims to [insert brief project goal from README, e.g., \"visualize global data,\" or \"create an interactive world map\"]. This project demonstrates [mention key features or functionality from README, e.g., \"data fetching and manipulation,\" or \"interactive UI elements\"]. It explores the topic of [mention specific focus from README if applicable, e.g., \"global economics,\" or \"population distribution\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce project built with Next.js 14 (using the Pages Router), TypeScript, and MUI, showcasing a type-safe approach to building dynamic user interfaces. Leveraging React Query for efficient data fetching and management, this repository demonstrates best practices for developing modern e-commerce applications, encompassing key topics like front-end development, UI/UX design, and data handling within a Next.js ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]