[
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS to visualize and interact with data from the Robofleet robotics fleet management system. This project provides a user-friendly dashboard for monitoring robot status, tracking performance metrics, and managing fleet operations, offering key insights into the overall health and efficiency of your robotic deployments. It focuses on enabling efficient project management and offers a comprehensive view of your robotic fleet.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It demonstrates best practices for building scalable and maintainable web applications with a focus on clean UI/UX principles and leveraging Next.js's server-side rendering and routing capabilities. This repository serves as a practical example and starting point for anyone looking to build their own data-driven dashboards or learn more about the Next.js ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring modern web development techniques using TypeScript and JavaScript. This repository serves as a playground for experimenting with various front-end architectures, state management solutions, and UI frameworks. It aims to demonstrate best practices and provide a learning resource for developers interested in building scalable and maintainable web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML to help users visualize and manage their sleep debt. This application allows individuals to track their sleep patterns and compare them against their ideal sleep schedule, providing insights into their accumulated sleep debt and promoting healthier sleep habits. Focusing on practical application of TypeScript in a project context, this repository offers a solution for those seeking to improve their sleep hygiene.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a collaborative project built with TypeScript, CSS, and JavaScript designed to facilitate brainstorming and idea generation. It allows users to create and share ideas, fostering a dynamic environment for project development and innovation. Focused on providing a user-friendly interface, this project showcases effective implementation of modern web technologies for project management and collaborative thinking.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, and PostgreSQL, providing a user-friendly interface crafted with HTML, CSS, and shell scripting for seamless deployment and management. This project demonstrates a practical implementation of creating, reading, updating, and deleting data, offering a solid foundation for understanding and building web applications using these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository contains a project focused on creating interactive map visualizations using HTML and Python. The project likely utilizes Python libraries for data processing and generation of map data, which is then rendered using HTML and potentially JavaScript for user interaction. It explores techniques for visualizing geographical data and presenting it in a user-friendly format on a map.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "atg-world",
        "description": "ATG World is a dynamic web project built with TypeScript, JavaScript, HTML, and CSS, focused on delivering [insert a short, descriptive phrase about the project's core function - e.g., an interactive world map, a user authentication system, a real-time data visualization tool]. This repository houses the source code for [mention the project's key features or goals - e.g., the front-end interface, the data processing logic, the API integration], aiming to provide [state the project's ultimate benefit or intended audience - e.g., a seamless user experience, a comprehensive data analysis platform, a practical learning resource].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a modern, real-time voting application built with Next.js, TypeScript, CSS, and JavaScript. This project showcases a clean and intuitive user interface for creating and participating in polls, offering a streamlined voting experience. It utilizes Next.js's server-side rendering capabilities for enhanced performance and SEO, making it a useful example project for learning modern web development techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "devboard",
        "description": "DevBoard is a full-stack project built with Next.js 14 (using the Pages Router), TypeScript, and MUI, designed to serve as a personal developer dashboard or portfolio. It leverages React Query for efficient data fetching and management, offering a clean and modern UI to showcase projects and skills. This repository demonstrates best practices in TypeScript development with Next.js and explores topics like component-driven architecture, state management, and UI/UX design principles within a project-focused context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using TeX for generating a professional-looking PDF and optionally served as an HTML version for online viewing. This project demonstrates my skills in document preparation and web development, serving as a concise and presentable summary of my qualifications and experiences.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-based project that creates a customizable and interactive event calendar using HTML, CSS, and JavaScript. This project allows users to dynamically display and manage events, making it a versatile solution for scheduling and organization within web applications. It focuses on providing a user-friendly experience with a visually appealing interface for easy event management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This IoT asset tracking project, built with Next.js, TypeScript, Tailwind CSS, and Supabase, provides a modern and efficient solution for monitoring and managing physical assets. Utilizing real-time data and a user-friendly interface, the application allows for location tracking, status updates, and comprehensive asset management. It leverages the power of Supabase for backend services and authentication, making it a scalable and robust platform for various IoT tracking applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a web application built with TypeScript, Vite, and Express that leverages the Gemini API to provide an interactive AI conversational experience. This project showcases the integration of AI models with modern web technologies, offering users a platform to engage in dynamic conversations and explore the capabilities of AI-powered communication. The front-end, crafted with HTML, CSS, and JavaScript, interacts seamlessly with the backend API, built with NodeJS.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting designed for visualizing and analyzing ROS (Robot Operating System) log files. This project provides a user-friendly interface to parse, filter, and display ROS log data, helping developers debug and understand their ROS-based applications more effectively. It focuses on improving the ROS development workflow by offering a convenient and interactive log analysis solution.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebooks and Python, contains various finance-related projects and tutorials. It explores financial concepts and analysis through practical coding examples, covering topics such as portfolio optimization, risk management, and time series analysis using popular Python libraries like NumPy, Pandas, and Matplotlib. It serves as a learning resource for individuals interested in applying Python to solve real-world financial problems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce platform for buying and selling fruits, built using Next.js 14 (Pages Router), TypeScript, and React. The project leverages MUI for a rich user interface and React Query for efficient data fetching and caching. This repository showcases a practical application of modern web development technologies and best practices for creating a type-safe and responsive online shopping experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]