[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt over time. This application provides a user-friendly interface to track sleep patterns and understand the impact of sleep on overall well-being. Focused on practicality and leveraging modern web technologies, this project serves as a personal tool for improving sleep habits and as a demonstration of skills in TypeScript-based front-end development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code and generated HTML output for my resume. Built using TeX for professional typesetting and compiled to HTML for easy online accessibility, this project showcases my skills and experience in a structured and presentable format.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based dashboard built using JavaScript, Python (likely for backend functionality), HTML, and CSS. This project aims to provide a user-friendly interface for visualizing and interacting with data from Robofleet, a robotic fleet management system. The dashboard likely focuses on monitoring robot status, task assignments, and performance metrics, providing insights into overall robotic fleet operations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project demonstrating a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It serves as a practical example of implementing server-side rendering, routing, and UI components within the Next.js framework, showcasing best practices for building dynamic and interactive web applications. This project provides a foundational structure and reusable components for developers looking to create their own dashboards or learn Next.js development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a personal project exploring modern web development techniques, built using TypeScript and JavaScript. This repository showcases a practical application of these languages, focusing on project organization and implementation. It serves as a learning ground for experimenting with different design patterns and architectural approaches in a structured manner.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and Shell scripting, this project allows users to easily parse, filter, and explore ROS log data through a user-friendly interface, aiding in debugging and understanding robot system behavior. It falls under the umbrella of project development, providing a practical solution for ROS developers.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project built with TypeScript, Vite, Express.js, and a Gemini API integration, designed to provide a platform for interactive conversations. Leveraging modern web technologies like CSS, HTML, and JavaScript, the project explores the use of AI in a user-friendly interface. This repository showcases a complete example of building a dynamic web application integrating backend API communication with a frontend built around modern tooling.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project showcasing a fully responsive and interactive event calendar built using JavaScript, CSS, and HTML. This repository provides a dynamic way to display and manage events directly within a web application, offering features like event creation, display, and potentially filtering, aiming to be a customizable and user-friendly event management solution.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a full-stack web application built with Next.js, TypeScript, Supabase, and Tailwind CSS for tracking IoT assets. It provides a user interface for visualizing and managing asset locations and data, leveraging Supabase for backend services and Tailwind CSS for styling. The project serves as a practical example of building a modern, scalable IoT solution using cutting-edge web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a Next.js 14 project built using TypeScript, CSS, and JavaScript, designed as a personal development dashboard. Leveraging the Next.js pages router, it incorporates MUI for UI components and React Query for efficient data fetching and caching. This project explores modern web development practices and provides a foundation for building custom dashboard applications with a focus on clean architecture and maintainable code.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project management tool built with TypeScript, CSS, and JavaScript, designed to facilitate brainstorming and organization of ideas within a team. This repository hosts the application's codebase, focusing on providing a visually intuitive and efficient platform for capturing, developing, and prioritizing project ideas. It's ideal for individuals or teams looking for a simple and effective solution for managing their creative workflows.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains Jupyter Notebooks and Python scripts for exploring financial concepts and performing data analysis in finance. It serves as a project-based learning resource, covering topics such as portfolio optimization, risk management, and financial modeling, all implemented using Python and its data science ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a modern, real-time voting application built with Next.js, TypeScript, CSS, and JavaScript, focusing on delivering a seamless and intuitive user experience for creating and participating in polls. This project showcases best practices in front-end development using Next.js features like server-side rendering and API routes, demonstrating a practical implementation of a collaborative and engaging voting platform.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This project, built with HTML and Python, focuses on creating interactive map visualizations. It leverages these technologies to display and analyze geographical data, providing a visual representation for various project-related data points on a map. The repository contains code for generating and customizing these map visualizations, potentially including features for data layering, filtering, and dynamic updates.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a Python-based CRUD application built with Flask and PostgreSQL, demonstrating a practical project implementation using HTML, CSS, and Shell scripting for setup and deployment. This repository showcases a full-stack application with typical Create, Read, Update, and Delete functionalities, providing a learning resource for developers interested in Flask, database interaction, and web application development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a dynamic web project built using TypeScript, JavaScript, HTML, and CSS, focused on [mention the main goal or feature described in the README, e.g., visualizing global data or creating an interactive world map]. This repository showcases the integration of modern web technologies to [mention what the project aims to achieve, e.g., provide a user-friendly interface for exploring complex datasets or offer an immersive geographical experience].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a modern e-commerce platform built with Next.js 14 utilizing the pages-router, TypeScript, and JavaScript. This project leverages React Query for efficient data fetching and MUI for a polished user interface, focusing on providing a type-safe and responsive shopping experience for users looking to purchase fresh produce online.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]