[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface for monitoring and managing robotic fleets, built using JavaScript, Python, HTML, and CSS. This project aims to provide real-time data visualization and control capabilities for robotics applications, offering a comprehensive overview of fleet status and performance within a single dashboard.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This CRUD Expense Tracker project, built with JavaScript, CSS, and HTML, provides a simple and intuitive interface for managing personal finances. It leverages Material-UI for a clean and responsive design, enabling users to easily create, read, update, and delete expense entries, facilitating better tracking and budgeting. This project serves as a practical example of implementing CRUD operations in a web application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a personal project built with Next.js 14 (using the pages router), TypeScript, and Material UI (MUI) to serve as a customizable developer dashboard. It leverages React Query for efficient data fetching and aims to provide a centralized location for frequently used development resources and information, showcasing practical application of modern web technologies like TypeScript and React in a functional and visually appealing interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built with TypeScript and JavaScript, focusing on [insert main project purpose, e.g., building a robust and scalable task management application, creating a modern and intuitive note-taking tool, or experimenting with advanced UI frameworks]. This repository serves as the primary codebase for the project, showcasing [mention key features or aspects highlighted in the README, e.g., modular design, API integration, or a specific UI framework]. It is intended to be a practical exploration and implementation of modern web development practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a responsive and interactive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It demonstrates modern web development practices and UI design principles, offering a template or starting point for building data-driven applications and administrative interfaces. This project focuses on practical implementation and provides a clear example of integrating front-end technologies within the Next.js framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository hosts the LaTeX and HTML source code for my resume, showcasing my skills and experience in a professional and easily customizable format. The project utilizes LaTeX for generating a printable PDF resume and HTML for a web-friendly online version, allowing for flexible deployment and maintenance of my professional profile.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML to help users track and manage their sleep debt. This application allows individuals to monitor their sleep patterns, calculate their accumulated sleep debt, and visualize progress towards achieving optimal sleep health. Designed as a practical exercise in TypeScript development, the project explores concepts related to data management, user interface design, and provides a user-friendly way to understand and improve sleep habits.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a dynamic project management application built with Next.js, TypeScript, and CSS, designed to facilitate collaborative brainstorming and organization of project ideas. Utilizing modern web development practices, this interactive board allows users to easily create, organize, and prioritize their ideas, promoting efficient teamwork and project planning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js, TypeScript, CSS, and JavaScript, designed to provide a simple and intuitive platform for creating and participating in polls. This project showcases best practices for modern web development, including server-side rendering, type safety, and responsive design, making it a valuable resource for developers interested in learning and contributing to interactive web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite.js, and Express.js that leverages the Gemini API to provide interactive conversational experiences. This project showcases the integration of modern web technologies with AI to create a dynamic and engaging platform for users to explore the capabilities of large language models.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built using Python (Flask framework), PostgreSQL for database management, and HTML, CSS, and Shell scripting for the frontend and deployment. This project showcases a basic web application demonstrating create, read, update, and delete operations, serving as a learning resource for developing Python-based web applications and utilizing PostgreSQL databases.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository, built using HTML and Python, focuses on creating dynamic map visualizations. It's a project showcasing techniques for displaying geographical data on interactive maps, leveraging web technologies for front-end presentation and potentially Python for data processing and map generation. The project explores various methods for presenting geographic data visually, making it ideal for understanding spatial patterns and relationships.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, contains projects exploring various aspects of finance. It provides practical examples and demonstrations of using Python for financial analysis, modeling, and data visualization. Explore the notebooks to learn how to apply Python to solve real-world financial problems and gain valuable insights into the world of finance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting to visualize and analyze ROS (Robot Operating System) log files. This project provides a user-friendly interface for filtering, searching, and displaying log messages, facilitating efficient debugging and monitoring of ROS-based systems. The repository serves as a centralized location for development and contribution to this log visualization tool.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository houses a modern web application built with Next.js, TypeScript, and Tailwind CSS for tracking IoT assets in real-time. Leveraging Supabase for backend services, the project provides a user-friendly interface to monitor and manage asset location and status, exploring key concepts in modern web development and IoT data visualization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a JavaScript-based project providing a dynamic and interactive event calendar. Built using HTML, CSS, and JavaScript, this repository demonstrates a practical implementation of a customizable calendar that can display and manage events, providing users with a visually appealing and functional way to organize their schedule.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a project built using TypeScript, JavaScript, HTML, and CSS, exploring and showcasing [mention the project's main purpose, e.g., interactive world maps, data visualization, or a specific application]. This repository serves as a learning ground and demonstration of skills in front-end development and data manipulation, focusing on [mention the project's key topics, e.g., geographical data, user interface design, or specific functionality].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a fully functional e-commerce website built with Next.js 14 utilizing the Pages Router, TypeScript, and styled with Material UI (MUI). This project serves as a practical example for implementing modern web development techniques including data fetching with React Query and strong typing with TypeScript, covering key topics such as e-commerce implementation, UI component libraries, and routing strategies within a Next.js application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]