[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users monitor and manage their sleep debt. Leveraging TypeScript for enhanced code quality and maintainability, this tool provides a visual and intuitive way to track sleep patterns and identify any accumulated sleep deficits, promoting better sleep hygiene and overall well-being. It serves as a practical example of using modern web technologies for personal productivity and health management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository, built with HTML and Python, visualizes geographical data on a map. The project focuses on creating interactive map-based visualizations, allowing users to explore and understand spatial datasets. Key aspects involve data processing, map rendering, and user interface design, making it a valuable learning resource and a foundation for more complex geospatial applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python and Flask, leveraging PostgreSQL for data persistence. This project demonstrates the creation of a web application with complete create, read, update, and delete functionality, utilizing HTML, CSS, and Shell scripting for various aspects of the deployment and application management. It serves as a practical example for learning and implementing CRUD operations with a Python backend and relational database.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js, TypeScript, CSS, and JavaScript, designed to provide a simple and intuitive platform for creating and participating in polls or voting events. This project explores modern web development practices and aims to deliver a user-friendly experience for both poll creators and voters, focusing on clean design and efficient functionality within the \"project\" topic.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting to visualize and analyze ROS (Robot Operating System) log files. This project simplifies the process of debugging and understanding ROS system behavior by providing an intuitive interface to filter, search, and display log messages, making it easier to identify errors and performance bottlenecks within your ROS-based applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a web application built with Next.js, TypeScript, CSS, and JavaScript for brainstorming, organizing, and prioritizing project ideas. This project provides a visual and interactive space to manage your thoughts, track progress, and collaborate on turning those ideas into reality.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-dashboard is a project utilizing JavaScript, Python, HTML, and CSS to create a dynamic and interactive dashboard interface. This repository focuses on building a user-friendly application, likely for monitoring and managing robotic fleets or similar systems, providing real-time data visualization and control capabilities through a web-based interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project management application built with Next.js 14 (Pages Router), TypeScript, and Material UI (MUI). This repository showcases a modern approach to web development, leveraging React Query for efficient data fetching and management. It serves as a practical example for developers looking to implement project management features with a focus on clean architecture, robust typing, and a polished user interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for generating the PDF and HTML for online viewing. It serves as a personal project demonstrating document creation with TeX and basic web development principles, aiming to showcase skills and experience in a professional and accessible format.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a project implementing a customizable and interactive event calendar using JavaScript, CSS, and HTML. It allows users to dynamically manage and visualize events within a calendar interface. This repository showcases a practical application of web technologies for building a functional and user-friendly event management tool.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository showcases a full-stack IoT asset tracking application built with Next.js, TypeScript, and Supabase for a robust and scalable solution. Leveraging Tailwind CSS for a modern UI, the project demonstrates real-time asset monitoring and management capabilities, providing a practical example of building IoT applications using cutting-edge technologies and best practices in the TypeScript ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, serves as a project-based exploration of financial concepts and applications. It contains code and analyses related to finance, covering topics such as stock market analysis, portfolio optimization, and potentially other financial modeling techniques. The project provides practical examples for learning and applying Python to real-world financial scenarios.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project demonstrating a modern web dashboard built with Next.js, TypeScript, CSS, and JavaScript. This repository showcases best practices for building dynamic and responsive user interfaces, featuring reusable components and a well-structured codebase. It serves as a template or a learning resource for developers looking to build their own data-driven dashboards.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript, aiming to [Insert Brief Project Goal, e.g., \"provide a streamlined task management solution\" or \"demonstrate a modern web application architecture\"]. This repository showcases [Mention key features or technologies highlighted, e.g., \"reactive programming patterns,\" \"a robust API integration,\" or \"a user-friendly interface\"], serving as a practical example of [Mention the repository's educational or illustrative purpose, e.g., \"best practices for TypeScript development\" or \"building scalable web applications\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a dynamic web application built with TypeScript, Vite.js, and Express.js, leveraging the Gemini API to provide users with engaging and interactive AI-powered conversations. This project demonstrates a practical application of modern web technologies, focusing on integrating AI models with a robust and responsive frontend. The codebase incorporates clean CSS and JavaScript for styling and functionality, showcasing a complete full-stack implementation of a conversational AI platform.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project showcasing interactive and dynamic web elements, built using TypeScript, JavaScript, HTML, and CSS. This repository demonstrates front-end development skills through the creation of visually engaging and functional components. Focused on practical application, the project explores various aspects of modern web development and offers a tangible example of leveraging these technologies to build interactive experiences.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a fully functional e-commerce web application built with Next.js 14 (Pages Router) and TypeScript, showcasing best practices for building modern, type-safe React applications. It leverages MUI for a polished user interface, React Query for efficient data fetching and caching, and adheres to a well-structured project architecture. This repository serves as a practical example for developers interested in learning or contributing to e-commerce development using these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]