[
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern and responsive dashboard built with Next.js, leveraging the power of TypeScript for type safety and maintainability, CSS for styling, and JavaScript for dynamic functionality. This repository demonstrates best practices for building interactive user interfaces and efficient data visualization within a robust dashboard environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project built using TypeScript, CSS, and JavaScript that implements a modern and efficient voting system. This repository contains the source code for the application, showcasing a practical application of these technologies in building a robust and user-friendly platform for managing and participating in various voting scenarios.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code for my resume. It's a personal project demonstrating proficiency in typesetting professional documents using LaTeX, focusing on a clear and effective presentation of skills and experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a project leveraging TypeScript, Vite.js, Express.js, and the Gemini API to create a web application focused on [describe main function of the project]. Built with a modern stack including HTML, CSS, and JavaScript, this repository showcases best practices in building a full-stack TypeScript application using a robust and scalable architecture.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains projects focused on finance. It explores various financial concepts and applications through practical examples and code, making it a valuable resource for anyone interested in learning finance with Python.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project showcasing interactive map visualizations built using HTML and Python. This repository explores various techniques for displaying and interacting with geographical data, leveraging Python for data processing and HTML for front-end presentation, falling under the general topic of data visualization projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript, designed to be a collaborative platform for brainstorming and organizing ideas. This project provides a visual and interactive way to manage thoughts, track progress, and facilitate team collaboration within a project setting. It's intended to streamline the idea generation and development process.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "jovian",
        "description": "The `jovian` repository is a Python-based CRUD application built with Flask and PostgreSQL, demonstrating a practical project implementation. It leverages HTML, CSS, and shell scripting alongside Python to create a fully functional web application, covering key concepts in project development and database interaction.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository provides a web-based interface built with JavaScript, Python, HTML, and CSS for visualizing and interacting with data from the Robofleet robotics platform. This project focuses on delivering a user-friendly dashboard for monitoring robot status, sensor readings, and other relevant information, enabling efficient management and analysis of robotic operations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "The atg-world repository is a project built using TypeScript, JavaScript, HTML, and CSS. It explores [mention the specific functionality or goal of the project if possible, e.g., \"interactive 3D world visualization,\" or \"a data-driven dashboard for analyzing global statistics\"]. This project aims to demonstrate [mention key features or skills used, e.g., \"modern web development techniques,\" or \"data visualization best practices\"] and serves as a showcase of [mention overall purpose, e.g., \"a personal portfolio piece,\" or \"a collaborative effort in web development\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "22052177",
        "description": "This project, built using TypeScript, JavaScript, CSS, and HTML, is a [briefly describe the project's purpose, e.g., web application, tool, library] and explores the topic of [mention the specific area of the project, e.g., data visualization, user authentication, game development]. It aims to [state the main goal of the project, e.g., provide a user-friendly interface, automate a specific task, demonstrate a particular concept].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/22052177/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/22052177",
        "liveLink": ""
    },
    {
        "title": "iot-asset-tracking",
        "description": "iot-asset-tracking is a Next.js project built with TypeScript, Tailwind CSS, and Supabase, designed to provide a comprehensive solution for tracking IoT assets. This repository demonstrates a modern web application architecture leveraging serverless functions and real-time database capabilities to manage and visualize the location and status of connected devices, serving as a template for similar data-driven projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a project built with JavaScript, CSS, and HTML to create a responsive and interactive calendar application. This repository showcases the implementation of dynamic event handling, allowing users to add, view, and manage events directly within the calendar interface. It serves as a practical example of front-end development techniques and provides a foundation for building more complex scheduling applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and shell scripting, this project provides an intuitive interface to parse and display log data, aiding in debugging and performance analysis within ROS projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    }
]