[
    {
        "title": "sleep-debt-tracker",
        "description": "The sleep-debt-tracker repository is a project built using TypeScript, JavaScript, HTML, and CSS to help users visualize and manage their sleep debt. It leverages TypeScript for enhanced code maintainability and explores practical application of the language within a front-end context. This project provides a simple and intuitive interface for tracking sleep patterns and identifying potential sleep deficits.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository provides a web-based interface, built with JavaScript, Python, HTML, and CSS, for visualizing and interacting with data from a Robofleet robotic system. It offers real-time monitoring and control capabilities, enabling users to remotely oversee robot operations, analyze performance metrics, and manage robot tasks, making it a central project for effective robot fleet management and data analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project built with TypeScript, CSS, and JavaScript that allows users to create and participate in various types of votes and polls. The application provides a streamlined and user-friendly interface for managing voting events, submitting choices, and viewing results, making it a versatile tool for decision-making processes across different contexts.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository houses the source code and generated output for my resume, built primarily using LaTeX for professional typesetting. An HTML version is also included for easier online viewing and sharing. This project demonstrates effective document generation and formatting techniques, categorized under the \"project\" topic, showcasing a practical application of TeX and HTML for personal branding.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project showcasing interactive map visualizations created using a combination of HTML for the front-end interface and Python for data processing and manipulation. This repository demonstrates techniques for displaying geographical data and creating engaging visual representations, exploring concepts related to data visualization and web-based mapping.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "The `jovian` repository implements a CRUD (Create, Read, Update, Delete) application built using Python and the Flask framework, leveraging PostgreSQL for data storage. This project demonstrates best practices for web application development with Python, encompassing HTML, CSS, and shell scripting for deployment and configuration, focusing on practical implementation of key web development concepts.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, and CSS, it provides a user-friendly interface to parse, filter, and display log data, aiding in debugging and understanding ROS system behavior. This project focuses on improving ROS development workflows through enhanced log analysis capabilities.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a web application built with TypeScript, CSS, JavaScript, HTML, Vite.js, and Express.js that leverages the Gemini API to provide an interactive and engaging project demonstrating AI communication capabilities. The project explores the integration of large language models within a modern web development stack.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a web-based project built with JavaScript, CSS, and HTML to create a dynamically updated and interactive event calendar. This repository provides a foundation for scheduling, displaying, and managing events with a focus on project-related functionality and customization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "iot-asset-tracking is a Next.js project built with TypeScript, Tailwind CSS, and Supabase to provide a modern, real-time solution for managing and tracking IoT assets. This repository demonstrates a comprehensive application utilizing these technologies to create a dynamic and efficient asset tracking platform.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "22052177",
        "description": "Project 22052177 is a web application built using TypeScript, JavaScript, CSS, and HTML. This project explores and implements various web development techniques and best practices, focusing on [mention a specific area of focus or goal if applicable, otherwise remove this part]. The repository serves as a demonstration and experimentation ground for learning and showcasing skills in front-end technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/22052177/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/22052177",
        "liveLink": ""
    },
    {
        "title": "devboard",
        "description": "Devboard is a project template built with Next.js 14 utilizing the pages router, TypeScript, and Material UI (MUI) for a modern and efficient development experience. It incorporates React Query for streamlined data fetching and management, offering a robust foundation for building scalable web applications. This repository serves as a practical example and starting point for projects leveraging these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project built with TypeScript, CSS, and JavaScript to showcase a modern and interactive dashboard interface. This repository demonstrates best practices for structuring a Next.js application, utilizing TypeScript for type safety, and creating visually appealing and responsive user interfaces using CSS and JavaScript. The project serves as a learning resource and a starting point for building complex dashboard applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring [briefly state project's purpose - e.g., \"modern web application architecture,\" \"a new data visualization tool,\" \"a comprehensive task management system\"]. Built using TypeScript and JavaScript, this repository showcases best practices for development and provides a foundation for [mention intended audience or benefit - e.g., \"building scalable applications,\" \"creating interactive dashboards,\" \"streamlining workflow management\"]. The core focus remains on [mention key project topic - e.g., \"application architecture,\" \"data visualization,\" \"project management\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project leveraging TypeScript, CSS, and JavaScript to create a dynamic and collaborative platform for brainstorming and organizing project ideas. It aims to provide users with a visually engaging and intuitive interface for capturing, developing, and prioritizing concepts within a project management context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "The atg-world repository is a project built using TypeScript, JavaScript, HTML, and CSS. This repository focuses on [clearly define the project's purpose here - e.g., \"building a dynamic web application,\" \"experimenting with frontend frameworks,\" or \"developing a specific tool\"]. It demonstrates [mention key functionalities or features - e.g., \"interactive map visualization,\" \"user authentication flow,\" or \"data processing pipeline\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, contains personal finance projects aimed at learning and demonstrating practical applications of data analysis and visualization in managing and understanding financial data. Expect to find examples of budgeting tools, investment trackers, and analyses leveraging Python's data science libraries.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a simple e-commerce project built with Next.js 14 utilizing the Pages Router, TypeScript, and JavaScript. It leverages MUI for the UI components and React Query for efficient data fetching and caching. This project explores fundamental e-commerce concepts while showcasing type-safe development practices within a modern React framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]