[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository provides a web-based interface for visualizing and interacting with data from the Robofleet robotics platform. Built using JavaScript, Python, HTML, and CSS, this project offers a dynamic dashboard for monitoring robot status, sensor readings, and task progress. It leverages these technologies to provide a user-friendly experience for controlling and observing robot operations, making it a valuable tool for managing and analyzing robotic deployments.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (Pages Router), TypeScript, and Material UI (MUI) to serve as a developer dashboard and personal project management tool. It leverages React Query for efficient data fetching and caching, providing a smooth user experience. This repository showcases a practical application of modern web development technologies and best practices, focusing on building a robust and scalable application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a personal project built using TypeScript and JavaScript, exploring modern web development practices. This repository serves as a playground for experimenting with different architectures, libraries, and tools within the JavaScript ecosystem. It's focused on building a scalable and maintainable application, showcasing best practices and patterns while delving into various aspects of project development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a responsive and interactive dashboard built with Next.js, TypeScript, CSS, and JavaScript. This repository serves as a practical example of a modern web application, demonstrating best practices in component design, data fetching, and UI development within the Next.js framework. It explores common dashboard features and layout strategies, making it a valuable resource for developers learning Next.js and looking to build data-driven user interfaces.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative platform built with TypeScript, CSS, and JavaScript for brainstorming, organizing, and prioritizing ideas within a project team. This project provides a visual and interactive board interface to capture thoughts, discuss their merits, and ultimately transform them into actionable plans. The application leverages modern web technologies to deliver a seamless and engaging user experience for effective idea management and project development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-Debt-Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users monitor and manage their sleep debt. This application allows users to log their sleep hours and track the difference between their ideal sleep schedule and their actual sleep, providing insights into their accumulated sleep debt. This project serves as a practical application of TypeScript and is tagged under the \"project\" and \"typescript\" topics.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a web-based CRUD application built with Python, Flask, and PostgreSQL, providing a streamlined interface for managing and manipulating data. Leveraging HTML, CSS, and Shell scripting for front-end design and deployment, this project showcases a practical implementation of a full-stack Python application encompassing database interactions and user interface development. The repository serves as a learning resource and a foundation for building similar data-driven web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project leveraging HTML and Python to create interactive map visualizations. This repository explores techniques for displaying geographical data and insights through dynamic and engaging maps, focusing on practical applications and demonstrations of map-based data representation. It serves as a learning resource and a foundation for developing custom map-based applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js (TypeScript, JavaScript) and styled with CSS, designed to provide a streamlined and user-friendly voting experience. This project showcases modern web development techniques and best practices within the broader context of project-based learning, offering a practical example of how to build a responsive and interactive voting platform.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository houses the source code for my resume, built using TeX for elegant formatting and compiled into a downloadable PDF. An HTML version is also included for online viewing and easy accessibility. As a personal project, it showcases my skills and experience in a professional and customizable format.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "iot-asset-tracking",
        "description": "The `iot-asset-tracking` repository implements a modern web application for tracking IoT assets, built with Next.js, TypeScript, and styled with Tailwind CSS. It leverages Supabase for backend services and data management, providing a project template for managing and visualizing IoT device locations and data in real-time. The project aims to be a practical example of using these technologies together for IoT solutions.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-based project creating a customizable and interactive event calendar. Built with HTML, CSS, and JavaScript, this repository provides a foundation for displaying and managing events within a web application, allowing for dynamic updates and potential integration with external data sources. The project aims to offer a flexible and visually appealing solution for scheduling and event management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project showcasing interactive and engaging web experiences built using TypeScript, JavaScript, HTML, and CSS. This repository explores various aspects of front-end development, aiming to create a dynamic and user-friendly platform for [mention the purpose of the website if you know, e.g., showcasing creative works, providing information on a specific topic, or offering a web application]. It serves as a demonstration of modern web development techniques and best practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for efficiently visualizing and analyzing ROS (Robot Operating System) log files. Built using JavaScript, Python (for backend processing), HTML, CSS, and Shell scripting, this project provides a user-friendly interface to parse, filter, and display ROS logs, enabling developers to quickly identify and debug issues within their robotic systems. It leverages web technologies to offer a convenient and accessible solution for ROS log analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebooks and Python, serves as a collection of projects exploring financial concepts and analysis. It leverages Python's powerful data analysis libraries to delve into topics such as stock market analysis, portfolio optimization, and potentially other areas of quantitative finance. It's a hands-on resource for learning and applying Python to real-world financial problems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project built with TypeScript, Vite, and Express.js, leveraging the Gemini API to provide interactive and engaging conversational experiences. This repository showcases a modern web application architecture, combining frontend technologies like HTML, CSS, and JavaScript with a robust backend, focusing on seamless integration of AI-powered communication features.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "fruit-seller is a comprehensive e-commerce platform built with Next.js 14 utilizing the Pages Router, TypeScript, and JavaScript. This project leverages MUI for a responsive and intuitive user interface and employs React Query for efficient data fetching and state management.  It showcases a robust type-safe approach to building modern web applications and serves as a practical example of implementing key e-commerce functionalities.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]