[
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (using the pages router), TypeScript, and styled with MUI. This repository showcases a modern web development workflow, leveraging React Query for efficient data fetching and management. The project serves as a development board, demonstrating practical implementation of cutting-edge technologies and best practices within a Next.js environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "The `sleep-debt-tracker` repository provides a web application built with TypeScript, JavaScript, HTML, and CSS that helps users track and manage their sleep debt. This project, categorized under the \"typescript\" topic, enables users to log their sleep hours and visualize their accumulated sleep debt over time, promoting better sleep habits.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "The dynamic-event-calendar repository provides a flexible and interactive event calendar built with JavaScript, CSS, and HTML. This project allows users to dynamically manage and display events with customizable features, offering a user-friendly interface for scheduling and viewing activities. The calendar leverages front-end technologies to provide a seamless experience for organizing and presenting events in a visually appealing manner.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "iot-asset-tracking is a Next.js project built with TypeScript, Tailwind CSS, and Supabase, designed to provide a comprehensive solution for managing and tracking IoT assets. This application leverages the power of modern web technologies to offer real-time asset location, status monitoring, and historical data analysis, making it easy to keep tabs on your valuable equipment and optimize operational efficiency.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-Voting is a dynamic, real-time voting platform built with Next.js, TypeScript, CSS, and JavaScript, offering a seamless and engaging user experience for creating and participating in polls. This project leverages modern web development practices to provide a robust and scalable solution for various voting scenarios, demonstrating best practices in front-end development and state management within a Next.js environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript to provide a visual and collaborative platform for brainstorming and organizing ideas. Leveraging modern web technologies, this application allows users to create and manage idea boards, facilitating project planning and creative collaboration by providing a streamlined space to capture, prioritize, and develop new concepts.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface built with JavaScript, Python, HTML, and CSS designed to visualize and interact with data from the Robofleet robotics platform. This project provides a comprehensive dashboard for monitoring robot status, viewing sensor data, and potentially controlling robot actions, serving as a valuable tool for developers and users working with robotic fleets. It's focused on creating a user-friendly and informative dashboard experience for managing and understanding robot operations within a project context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains a collection of finance-related projects designed to explore and apply financial concepts using practical code examples. It serves as a hands-on learning resource for individuals interested in using Python to analyze financial data, implement trading strategies, and gain insights into various financial topics.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project built with TypeScript, CSS, and JavaScript, showcasing a modern dashboard implementation using the Next.js framework. It provides a foundational structure and example components for building interactive and data-rich dashboards, making it a useful starting point or reference for developers learning or implementing similar interfaces.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript, aiming to [Insert the main goal of the project based on the README or assumed functionality, e.g., \"provide a modern and efficient chat application\" or \"offer a robust task management system\"]. This repository explores best practices in [Mention a specific aspect like front-end development, data management or API integration, if applicable] and serves as a practical example of modern web development techniques. It focuses on the core concepts of the project and allows for easy extension and customization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project focused on creating interactive map visualizations using HTML for the front-end interface and Python for backend data processing and potentially server-side logic (if applicable). This repository showcases techniques for displaying geographic data and creating engaging map-based experiences.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a CRUD application built with Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting, providing a hands-on project demonstrating database interactions and web development principles. This repository showcases how to create, read, update, and delete data using a robust backend and a simple, user-friendly interface, making it a valuable learning resource for beginners and those looking to reinforce their skills in Python-based web development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project leveraging TypeScript, Vite.js, and Express.js to provide an interactive conversational experience powered by the Gemini API. This repository explores the integration of modern web technologies with AI to create a dynamic and engaging platform, showcasing best practices in TypeScript development and server-side API integration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a personal project built with TypeScript, JavaScript, HTML, and CSS, showcasing a web application focused on [mention the core functionality or purpose of the project as found in the README, e.g., interactive data visualization, user authentication, or a specific type of simulation].  This repository demonstrates proficiency in front-end development and explores concepts related to the declared project topic.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool, built with JavaScript, Python, HTML, CSS, and Shell scripting, for visualizing and analyzing ROS (Robot Operating System) log files. This project provides a user-friendly interface to filter, search, and understand the information contained within ROS logs, aiding in debugging and performance analysis of robotics systems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the LaTeX source code for my resume, along with an HTML version generated from it. It serves as a project showcasing my skills in both TeX typesetting and web development, allowing for easy online presentation and downloadable PDF versions of my professional experience and qualifications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a fully-featured e-commerce project built with Next.js 14 (pages router) and TypeScript, showcasing a modern and type-safe approach to web development. Leveraging React Query for efficient data fetching and MUI for a sleek user interface, this repository demonstrates best practices for building scalable and maintainable e-commerce applications, covering topics such as shopping cart functionality, product browsing, and potentially order management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]