[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt. This application allows users to track their sleep patterns and calculate the difference between their ideal and actual sleep hours, providing insights into potential sleep deprivation and promoting better sleep habits. It serves as a practical application showcasing TypeScript development and project organization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a modern, full-stack project built with Next.js 14 utilizing the pages router, TypeScript, and React Query for efficient data fetching. This project leverages MUI for a polished user interface and demonstrates best practices for structuring and developing applications with these technologies, focusing on topics such as state management, component design, and routing within a Next.js environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface, built using JavaScript, Python, HTML, and CSS, designed to visualize and interact with data from a Robofleet system. This project aims to provide a user-friendly dashboard for monitoring robot status, sensor data, and mission progress, making it a valuable tool for managing and controlling robotic fleets.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack project showcasing a real-time voting application built with Next.js, TypeScript, CSS, and JavaScript. It allows users to create and participate in polls, providing a dynamic and engaging voting experience. The project demonstrates best practices in modern web development, covering topics such as server-side rendering, client-side interactivity, and responsive design for a seamless user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository, built with HTML and Python, focuses on map visualization. It's a project exploring different techniques to represent geographic data and create interactive maps, leveraging web technologies for display and potentially Python for data processing and backend functionality. The repository aims to provide a foundation for visualizing spatial information and building map-based applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a CRUD (Create, Read, Update, Delete) application built using Python and Flask, demonstrating a practical implementation of web development principles. This project utilizes PostgreSQL for database management and is styled with HTML and CSS for a user-friendly interface. Leveraging concepts such as database interaction and web framework structure, Jovian serves as a valuable learning resource and example for building similar Python-based web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It's designed to provide a clean and intuitive user interface for managing data and analytics, demonstrating best practices for building scalable web applications with the Next.js framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring [mention specific technologies if README provides context, e.g., \"real-time communication\" or \"data visualization\"] built using TypeScript and JavaScript. This repository serves as a learning ground and showcases [mention specific goals or features if the README elaborates, e.g., \"a modern web application architecture\" or \"interactive dashboard components\"]. It's focused on [mention specific topic, e.g., \"project management\" or \"a data analysis tool\"] and aims to [mention the project's objective, e.g., \"provide a streamlined workflow\" or \"offer insightful data visualizations\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a web application built with TypeScript, Vite, and Express.js that leverages the Gemini API to provide an interactive and engaging AI conversation experience. This project explores server-side rendering, modern web development practices, and offers a practical implementation of the Gemini API within a full-stack TypeScript environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code and compiled HTML versions of my resume. It serves as a project showcasing my resume's design and content, leveraging TeX for professional formatting and HTML for online accessibility. The project demonstrates my skills in both document preparation and web development through a single, focused portfolio piece.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a project providing a user-friendly web interface built with JavaScript, HTML, CSS, and Python (likely for backend processing or data parsing) to visualize and analyze ROS (Robot Operating System) log files. It aims to simplify debugging and monitoring of ROS-based robotic systems by presenting log data in an organized and easily digestible manner, enabling developers to quickly identify and resolve issues. The repository leverages shell scripts for potential build or deployment automation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript, CSS, and HTML project designed to create a visually appealing and interactive event calendar. It provides a dynamic user interface for displaying and managing events, offering a customizable and user-friendly experience. This project showcases front-end development skills and serves as a practical example for learning about calendar implementations and event handling within a web environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository houses a full-stack web application built with Next.js, TypeScript, and Tailwind CSS for IoT asset tracking, leveraging Supabase for database management and authentication. The project demonstrates a modern approach to building a user-friendly interface for monitoring and managing IoT-connected assets, offering a practical example of integrating frontend and backend technologies for real-world applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a project built with TypeScript, CSS, and JavaScript designed to be a collaborative platform for brainstorming, organizing, and developing project ideas. This repository hosts the code for a dynamic and interactive idea board application, facilitating seamless idea generation and management within a project team. It leverages modern web technologies to create a user-friendly and efficient workflow for project development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebooks and Python, explores various financial concepts and applications through hands-on projects. It aims to provide practical examples and insights into financial analysis, modeling, and visualization, covering topics like portfolio optimization, time series analysis, and risk management. This project-based learning resource offers a valuable starting point for anyone interested in applying Python to finance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a dynamic web project built with TypeScript, JavaScript, HTML, and CSS, focused on [Insert purpose of project here, e.g., showcasing interactive maps or providing a platform for location-based information]. It leverages modern web development practices to deliver [mention key functionalities, e.g., a user-friendly experience with detailed map visualizations] and explores the intersection of web technologies with project-based learning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a comprehensive e-commerce platform built with Next.js 14, leveraging the power of TypeScript, React Query for efficient data fetching, and Material UI (MUI) for a visually appealing and responsive user interface. This project, structured with the Next.js Pages Router, showcases best practices in modern web development and serves as a practical example of building a fully functional online store.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]