[
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project template built with Next.js 14 using the Pages Router, designed to accelerate the development of modern web applications. Leveraging TypeScript for type safety and React Query for efficient data fetching, this project incorporates Material UI (MUI) for a sleek and responsive user interface, serving as a robust foundation for building scalable and maintainable projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built with TypeScript and JavaScript, focusing on [mention project's specific purpose or feature if known from README, otherwise use a general term like \"modern web development\"]. This repository showcases [mention key functionalities or aspects of the project] and serves as a learning resource for developers interested in exploring [mention relevant concepts like reactive programming, state management, or UI frameworks used in the project, if available from README].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a responsive and interactive dashboard built with Next.js, TypeScript, CSS, and JavaScript. This repository demonstrates modern web development practices, featuring a modular component structure, data fetching strategies, and a focus on UI/UX to create a visually appealing and functional dashboard experience. It serves as a practical example for learning and implementing dashboard interfaces using the Next.js framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface built with JavaScript, Python, HTML, and CSS designed for monitoring and managing robotic fleets. This project provides a user-friendly dashboard allowing users to visualize robot status, track performance metrics, and potentially control individual robots within a fleet, aligning with the broader topic of robotics project development and deployment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using TeX for generating a clean and professional PDF, and HTML for a web-viewable version. This personal project showcases my skills and experience in a structured format, demonstrating my ability to leverage different technologies for effective presentation. It serves as a readily accessible and easily customizable template for creating professional resumes.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project utilizing TypeScript, CSS, and JavaScript to create a dynamic and interactive online platform for brainstorming and organizing ideas. This project facilitates idea generation, voting, and prioritization, fostering a streamlined workflow for teams and individuals to develop innovative solutions. It's designed as a central hub for managing the entire ideation process, from initial concept to actionable plans.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a web application built with TypeScript, JavaScript, CSS, and HTML designed to help users monitor and manage their sleep debt. This project allows users to log sleep hours, track their ideal sleep schedule, and visualize their sleep patterns over time, promoting better sleep habits. It leverages modern web development practices and serves as a practical example of a TypeScript-based project.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built using Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting. This project showcases the development of a web application with complete Create, Read, Update, and Delete functionality, leveraging a robust backend framework and database for data management, providing a practical example of a Python-based web development project.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository hosts a project focused on visualizing geographical data using interactive maps. Built with HTML for the front-end interface and Python for data processing and potential back-end functionality, the project leverages map visualization techniques to present spatial information in an engaging and informative manner. The code within demonstrates a practical application of web development principles combined with data analysis for creating dynamic and user-friendly map-based applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, contains various projects focused on financial analysis and modeling. It explores key finance concepts through practical application, covering topics such as stock analysis, portfolio optimization, and potentially other financial modeling techniques, providing a hands-on learning experience in applying Python to real-world financial problems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a Next.js-based web application for IoT asset tracking, leveraging Supabase for backend services and Tailwind CSS for styling. Built with TypeScript, CSS, and JavaScript, this project provides a user interface for monitoring and managing IoT devices, demonstrating a practical implementation of modern web technologies for real-time asset management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project showcasing a dynamic and interactive event calendar built using JavaScript, CSS, and HTML. This repository demonstrates front-end development techniques for creating a user-friendly calendar interface where events can be dynamically loaded, displayed, and potentially managed. It serves as a learning resource and a foundation for building more complex calendar applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-Voting is a modern, real-time voting application built with Next.js, TypeScript, CSS, and JavaScript, focusing on providing a seamless and secure voting experience. This project leverages the power of Next.js for server-side rendering and efficient routing, while TypeScript ensures code maintainability and scalability. Designed with user-friendliness in mind, Next-Voting allows for the creation and participation in polls with instant result updates, making it an ideal solution for various decision-making scenarios.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a personal project showcasing interactive web development skills using TypeScript, JavaScript, HTML, and CSS. This repository features a dynamic and engaging application designed to explore and demonstrate proficiency in front-end technologies and project management within a web development context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a dynamic web application built with TypeScript, Vite, Express.js, and Gemini API, offering users engaging and insightful conversations driven by cutting-edge AI. Leveraging a modern tech stack including HTML, CSS, and JavaScript, this project explores the possibilities of AI-powered communication and serves as a practical example of integrating the Gemini API with a robust backend infrastructure for interactive user experiences.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting to visualize and analyze ROS (Robot Operating System) log files. This project aims to provide a user-friendly interface for filtering, searching, and understanding ROS logs, enabling developers to quickly identify and debug issues in their robotic systems. It covers the topic of project management and offers a convenient way to gain insights from ROS logging data.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a comprehensive e-commerce web application built with Next.js 14 (using the pages router), TypeScript, and styled with Material UI (MUI). This project showcases a fully functional online store for selling fruits, leveraging React Query for efficient data fetching and management.  It serves as a practical example for developers learning modern web development techniques, including type-safe development and building performant, user-friendly interfaces for e-commerce platforms.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]