[
    {
        "title": "devboard",
        "description": "Devboard is a project management application built with Next.js 14 utilizing the pages-router, TypeScript, and CSS for a modern and type-safe frontend experience. It leverages React Query for efficient data fetching and caching, and Material UI (MUI) for a consistent and responsive user interface, showcasing best practices for building robust web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project showcasing map data visualization techniques, primarily utilizing HTML for the front-end interface and Python for data processing and backend logic. This repository explores methods for creating interactive and informative map displays, focusing on [mention a specific visualization technique if applicable, e.g., choropleth maps, point maps, etc.], and is a valuable resource for anyone interested in geospatial data representation and interactive mapping.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "This repository showcases a CRUD (Create, Read, Update, Delete) application built using Python, Flask, and PostgreSQL. It demonstrates a full-stack project using HTML, CSS, and shell scripting for deployment and management. This project serves as a practical example of building a data-driven web application with a focus on backend functionality and database integration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML to help users visualize and manage their sleep debt. This repository provides tools to track sleep patterns, calculate sleep debt, and offer insights for improving sleep habits. The project serves as a demonstration of modern web development practices using TypeScript and related technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, interactive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It provides a foundation for building complex web applications with a focus on component-based architecture and efficient data management, demonstrating best practices in front-end development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven v2 is a project built with TypeScript and JavaScript, focused on [briefly describe the project's purpose - e.g., streamlined data visualization, a real-time communication platform, a command-line utility]. This repository contains the source code and related resources for this initiative, covering topics related to [mention key topics related to the project - e.g., data analysis, web development, command-line interface design].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project built with TypeScript, CSS, and JavaScript that aims to provide a modern and intuitive platform for creating and participating in online voting. This repository contains the source code for the application, focusing on user interface, data management, and voting logic within a web-based environment. It serves as a practical example of a full-stack web application utilizing these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "robofleet-dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS for visualizing and interacting with the Robofleet robotics system. This project provides a user-friendly dashboard for monitoring robot status, controlling robot behavior, and analyzing data collected from robots, leveraging web technologies to create a powerful and accessible tool.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code and generated output for my resume. Built using TeX for elegant formatting and HTML for web accessibility, this project showcases a professional resume and provides a template for others to create their own. It serves as a practical example of combining technical skills for personal branding and falls under the \"project\" topic category.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a project built with JavaScript, CSS, and HTML to create a visually appealing and interactive calendar that allows users to dynamically manage and display events. This repository provides a foundation for building a custom event calendar solution, encompassing event creation, display, and manipulation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "IoT Asset Tracking is a web application built with Next.js, TypeScript, TailwindCSS, and Supabase designed to monitor and manage IoT assets in real-time. This project showcases a modern full-stack implementation utilizing serverless functions, database integration, and a responsive user interface, demonstrating best practices for building scalable and efficient asset tracking solutions.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and shell scripting, this project aims to provide a user-friendly interface for filtering, searching, and interpreting ROS log data to facilitate debugging and performance analysis in ROS-based robotics projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project designed to help users brainstorm and organize their ideas. Built using TypeScript, CSS, and JavaScript, this repository provides a flexible and visually appealing interface for capturing, connecting, and developing new concepts. It focuses on streamlining the project planning and idea management process, making it easier to turn inspiration into actionable steps.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a project leveraging the Gemini API, built with TypeScript and Vite.js, to create an engaging application using Express.js on the backend and a dynamic frontend crafted with HTML, CSS, and JavaScript. This repository showcases a practical implementation of integrating cutting-edge AI capabilities into a modern web application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "22052177",
        "description": "This project, built using TypeScript, JavaScript, CSS, and HTML, explores various concepts related to the \"project\" topic. It serves as a learning platform and showcase for web development skills, focusing on utilizing modern front-end technologies to create interactive and dynamic user experiences. The codebase offers examples of how to effectively structure and implement web applications with these languages.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/22052177/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/22052177",
        "liveLink": ""
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, houses a collection of projects focused on applying Python to various financial applications. Topics covered include financial analysis, modeling, data visualization, and algorithmic trading strategies, providing practical examples and reusable code for learning and exploring the world of finance with Python.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a project built using TypeScript, JavaScript, HTML, and CSS. This repository contains the codebase for the project, focusing on [briefly mention the project's purpose, e.g., creating an interactive world map, building a web application for managing tasks, etc.]. It leverages modern web development technologies to achieve its goal.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    }
]