[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface built with JavaScript, Python, HTML, and CSS for visualizing and interacting with robotic systems managed by Robofleet. This project focuses on providing a user-friendly dashboard for monitoring robot status, viewing sensor data, and controlling robot actions, effectively serving as a central point for managing and observing a fleet of robots within the Robofleet ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This CRUD Expense Tracker, built using JavaScript, CSS, and HTML with a Material-UI framework, allows users to efficiently manage and track their expenses through a simple and intuitive interface. It provides core CRUD (Create, Read, Update, Delete) operations for expense entries, making it a practical project demonstrating fundamental web development principles and modern UI component usage.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a Next.js 14 project built with TypeScript, utilizing the Pages Router, React Query for efficient data fetching, and MUI (Material UI) for a clean and modern UI. This project serves as a development board, showcasing best practices and a structured approach to building scalable web applications with these technologies, offering a valuable learning resource for developers.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built with TypeScript and JavaScript, aiming to [add a brief, high-level description of the project's purpose - e.g., \"provide a modern, performant, and extensible web application framework,\" or \"offer a suite of tools for data analysis and visualization\"]. It leverages modern web development techniques and best practices to deliver a robust and scalable solution, focusing on [mention key aspects or goals based on topics and README, e.g., \"clean code, maintainability, and ease of use\" or \"efficient data processing and insightful visualizations\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern, responsive dashboard project built with Next.js, TypeScript, CSS, and JavaScript, showcasing a clean and efficient UI design. It aims to provide a practical example of implementing a dashboard interface with Next.js, demonstrating best practices for routing, data fetching, and component structuring within a modern React framework. This project serves as a helpful resource for developers looking to learn or improve their skills in building dynamic web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code and build artifacts for my resume, utilizing TeX for document creation and HTML for web presentation. It serves as a project showcasing my skills in document generation, web development, and version control, demonstrating a clean and professional presentation of my qualifications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "jovian",
        "description": "Jovian is a CRUD application built with Python, Flask, and PostgreSQL, designed to demonstrate practical web development skills. This project utilizes HTML, CSS, and shell scripting for a complete user experience, encompassing topics such as database management, backend logic, and frontend presentation. It serves as a learning resource and a foundation for creating similar web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project that leverages HTML and Python to create interactive map visualizations. This repository focuses on exploring and showcasing various techniques for representing geographical data on maps, likely including features like data layering, custom markers, and interactive elements. It serves as a practical demonstration and learning resource for map visualization using web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-Debt-Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt. This tool allows users to track their sleep patterns, calculate accumulated sleep debt, and visualize their progress towards achieving optimal rest, offering a practical solution for improving sleep habits and promoting overall well-being. This repository focuses on demonstrating practical application of TypeScript in a front-end project.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a web application built with Next.js (TypeScript, CSS, and JavaScript) designed to serve as a collaborative project idea board. Users can easily add, organize, and discuss potential project ideas, fostering creativity and collaboration within a team or community. This project showcases a clean, intuitive interface for brainstorming and managing projects, and focuses on providing a space for project collaboration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository hosts a collection of Jupyter Notebook projects leveraging Python for financial analysis and modeling. It explores various financial concepts, including stock analysis, portfolio optimization, and potentially other data-driven finance applications. The projects within demonstrate practical implementations of Python libraries for manipulating and visualizing financial data, providing a hands-on learning resource for anyone interested in applying Python to finance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack project built with TypeScript, CSS, and JavaScript, designed to provide a platform for creating and participating in various voting systems. Utilizing Next.js for server-side rendering and a modern UI, this repository explores best practices for building interactive and scalable web applications focused on user authentication, data management, and secure voting mechanisms. It serves as a learning resource and a foundation for developing custom voting solutions.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT asset tracking web application built with Next.js, TypeScript, and styled with Tailwind CSS. Utilizing Supabase for backend services, this project provides a real-time interface for monitoring and managing IoT-connected assets, offering a practical example of a full-stack solution integrating front-end frameworks, serverless architecture, and robust data management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "This repository hosts a dynamic event calendar built with JavaScript, CSS, and HTML, designed as a project to showcase interactive web development skills. It allows users to view and potentially manage events on a calendar interface, demonstrating front-end development techniques and a practical application of these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a personal project showcasing web development skills using TypeScript, JavaScript, HTML, and CSS. This repository focuses on building an interactive and engaging web application, potentially exploring user interfaces and dynamic content rendering, as demonstrated by the blend of front-end technologies employed. The project aims to provide a hands-on exploration of modern web development practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a web application built with TypeScript, Vite, and Express.js, leveraging the Gemini API to provide users with an interactive AI-powered conversational experience. The project showcases a modern tech stack, including CSS, JavaScript, and HTML for the front-end, and explores the integration of AI models within a web application framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and Shell scripting, this project provides an intuitive interface to parse, filter, and display log data, aiding in debugging and understanding ROS system behavior. It enables users to efficiently identify potential issues and gain insights from the often verbose output of ROS applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce project built with Next.js 14 (pages router) and TypeScript, showcasing a modern approach to online fruit sales. Leveraging MUI for a sleek user interface and React Query for efficient data fetching, this repository provides a type-safe and performant solution for building similar e-commerce platforms. Key technologies include TypeScript, JavaScript, Next.js 14, MUI, and React Query.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]