[
    {
        "title": "devboard",
        "description": "Devboard is a full-stack web application built with Next.js 14 (pages router), TypeScript, and Material UI (MUI) to serve as a project management dashboard. This project leverages React Query for efficient data fetching and caching, providing a robust and user-friendly interface for organizing and tracking projects. It explores best practices in modern web development and TypeScript implementation within the Next.js framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a project built using JavaScript, Python, HTML, and CSS to create a dynamic and interactive dashboard. This project focuses on visualizing and managing data related to robotic fleets, providing a user-friendly interface for monitoring robot status, tasks, and performance metrics. It aims to offer insights and control for optimizing robotic fleet operations and is tagged under the 'project' topic.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project exploring modern web development techniques, built using TypeScript and JavaScript. This repository focuses on implementing [Insert brief, high-level purpose of the project from the README, e.g., a streamlined note-taking application, a dynamic dashboard interface, etc.]. It serves as a practical example of [Mention key architectural patterns or libraries used, e.g., component-based architecture, React framework, etc.] and showcases best practices in project structure and code organization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern, responsive dashboard project built with Next.js, TypeScript, CSS, and JavaScript. It showcases a practical application of these technologies in creating a dynamic and user-friendly interface, focusing on clean code and efficient data handling. The project serves as a learning resource and a starting point for developers looking to build similar dashboard applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains my resume, implemented using TeX for generating a polished PDF and HTML for easy online viewing. It serves as a personal project showcasing my skills and experience, utilizing both typesetting and web technologies to present my professional profile in a clear and accessible manner.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a project management tool built with Next.js, TypeScript, CSS, and JavaScript, designed to help users brainstorm, organize, and prioritize their ideas in a visually appealing and intuitive way. This repository implements a dynamic board interface with drag-and-drop functionality, allowing for seamless task management and collaboration. It serves as a modern and efficient solution for project planning and ideation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a web application built with TypeScript, JavaScript, CSS, and HTML that helps users monitor and manage their sleep debt. This project allows users to track their sleep patterns, calculate their sleep debt based on desired sleep hours, and visualize their progress over time. This project uses TypeScript and is a great demonstration of practical application of TypeScript in web development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a Python-based CRUD application built with Flask, PostgreSQL, HTML, CSS, and Shell scripting, designed as a project to demonstrate fundamental web development principles. It allows users to create, read, update, and delete data, showcasing how to integrate a Python backend with a relational database and a basic web interface, covering topics like database interactions, web framework usage, and basic front-end development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project leveraging HTML and Python to create interactive map visualizations. This repository showcases techniques for displaying geographical data and insights on a map interface, focusing on practical application and clear presentation of project-related information.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, `finance-with-python`, contains a collection of projects and tutorials using Python and Jupyter Notebooks to explore various aspects of finance. It covers topics like portfolio optimization, risk analysis, time series analysis of financial data, and potentially other quantitative finance techniques. This is achieved by providing practical examples and code snippets, making it a valuable resource for anyone looking to learn or apply Python for financial analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-voting",
        "description": "Next-Voting is a full-stack web application built with Next.js (TypeScript, CSS, and JavaScript) designed to provide a user-friendly platform for creating and participating in polls and surveys. This project showcases modern web development techniques and offers a practical example of implementing real-time voting functionality.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern web application built with Next.js, TypeScript, and Tailwind CSS for tracking IoT assets using Supabase as a backend.  It provides a user-friendly interface to monitor asset locations, status, and historical data, demonstrating a full-stack implementation of an IoT asset tracking solution using cutting-edge web development technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript, CSS, and HTML-based project for creating interactive and customizable event calendars. This repository provides a flexible solution for displaying and managing events within a web application, allowing users to easily visualize schedules and appointments. The calendar's dynamic nature enables seamless integration and updates, making it a versatile tool for various project needs.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool written in JavaScript, Python, HTML, CSS, and Shell scripting designed to visualize and analyze ROS (Robot Operating System) log files. This project provides a user-friendly interface for filtering, searching, and interpreting ROS logs, making it easier to debug and understand robotic system behavior. The repository focuses on providing a practical solution for ROS developers within the broader project ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a web project built with TypeScript, JavaScript, HTML, and CSS, exploring interactive world visualizations and dynamic content rendering. This repository focuses on implementing engaging user experiences and efficient data handling for presenting geographical information and related data points, showcasing project-specific development skills and web development best practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project leveraging TypeScript, Vite.js, and Express.js to create a dynamic platform that integrates with the Gemini API. This repository showcases a modern web application architecture, encompassing frontend development with HTML, CSS, and JavaScript, and backend API integration for engaging conversations and potential AI-powered features.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce project built with Next.js 14 (using the pages router), TypeScript, and React, leveraging MUI for a polished user interface. This repository showcases a type-safe and performant online store implementation, incorporating React Query for efficient data fetching and management. The project aims to provide a practical example of modern web development techniques applied to an e-commerce platform.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]