[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users monitor and manage their sleep debt. This repository provides a tool to track sleep patterns, calculate sleep debt based on individual needs, and visualize progress towards achieving a healthy sleep schedule. As a TypeScript-focused project, it demonstrates best practices for building robust and maintainable applications with type safety.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern web application project built with Next.js, TypeScript, CSS, and JavaScript, offering a robust foundation for creating dynamic and interactive dashboards. This repository showcases best practices for structuring a Next.js application and implementing common dashboard features, serving as a practical example for developers looking to build their own data-driven interfaces.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "raven-v2 is a project built using TypeScript and JavaScript. This repository serves as the core codebase for [briefly state the project's purpose, e.g., \"a real-time data visualization platform\" or \"a task management application\"]. It leverages the strengths of both languages to provide a robust and scalable solution.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository is a web-based project built with JavaScript, Python, HTML, and CSS designed to provide a user-friendly interface for monitoring and managing robotic fleets. This dashboard facilitates real-time data visualization, control functionalities, and overall system management for applications involving robotics deployments, making it a central hub for project-related tasks and information.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "22052177",
        "description": "This project, built with TypeScript, JavaScript, CSS, and HTML, showcases a [briefly state the purpose of the project - e.g., \"dynamic web application\", \"interactive data visualization\", \"responsive website\"] and focuses on [mention key features or goals related to the \"project\" topic - e.g., \"clean UI design\", \"efficient data handling\", \"user-friendly navigation\"]. It's a practical example of leveraging modern web technologies to create a functional and engaging user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/22052177/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/22052177",
        "liveLink": ""
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project built with TypeScript, CSS, and JavaScript, designed to provide a modern and efficient voting platform. It leverages these technologies to create a user-friendly interface and robust backend, focusing on providing a seamless and secure voting experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains a collection of finance-related projects. It explores various topics within finance, leveraging Python's data analysis and visualization capabilities to implement practical solutions and gain insights from financial data.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using TeX for document formatting and HTML for potential web display. The project focuses on showcasing my skills and experience in a professional and easily customizable format.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project utilizing HTML and Python to create interactive map visualizations. This repository showcases techniques for presenting geographical data in a user-friendly and informative way, focusing on practical application of map-related data presentation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "The jovian repository is a Python-based web application project built with Flask, utilizing PostgreSQL for data storage and styled with HTML and CSS. This project demonstrates a CRUD (Create, Read, Update, Delete) application, offering a practical example of web development with these technologies and encompassing key topics like database interaction, server-side logic, and front-end presentation, all orchestrated with shell scripting for deployment and management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript for collaborative idea generation and organization. This interactive board allows users to easily brainstorm, collect, and manage project ideas in a visually appealing and intuitive manner, fostering creativity and efficient project planning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project built with JavaScript, CSS, and HTML to create a dynamic and interactive event calendar. This repository showcases a front-end implementation for managing and displaying events, offering a user-friendly interface to visualize scheduling and promote organized event planning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "iot-asset-tracking is a Next.js project built with TypeScript, styled with Tailwind CSS, and utilizing Supabase for backend services, demonstrating a solution for tracking IoT assets. This repository showcases a full-stack application architecture encompassing front-end development, data management, and real-time asset location visualization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a project built using JavaScript, Python, HTML, CSS, and Shell scripts, designed to provide a user-friendly interface for visualizing and analyzing ROS (Robot Operating System) log files. This tool aims to simplify debugging and performance analysis for ROS applications by offering a clear and interactive representation of log data.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a project built with TypeScript, CSS, JavaScript, and HTML, leveraging Express.js and Vite.js to create a platform that interacts with the Gemini API. This repository explores the integration of large language models within a web application, showcasing practical use cases and implementations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a project template built with Next.js 14 (using the pages router), TypeScript, and styled with CSS and MUI (Material UI). It serves as a starter kit for quickly launching web applications, incorporating best practices for data fetching with React Query and offering a robust, type-safe foundation for development. Key topics covered include component styling, server-side rendering, and state management within a modern React ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "The atg-world repository is a project built using TypeScript, JavaScript, HTML, and CSS. It encompasses [briefly describe the project's function or goal - e.g., \"a dynamic web application,\" \"an interactive game,\" \"a collection of utility functions\"]. This project showcases [mention a key feature or aspect of the project - e.g., \"modern web development techniques,\" \"efficient data handling,\" \"responsive design\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "fruit-seller is a comprehensive e-commerce project built with Next.js 14 (utilizing the Pages Router), TypeScript, and JavaScript. This repository demonstrates best practices for modern web development, incorporating MUI for a polished UI, React Query for efficient data fetching and caching, and strong typing for robust code. The project serves as a practical example for developers looking to implement similar features or learn more about these technologies within an e-commerce context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]