[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML that helps users visualize and track their accumulated sleep debt over time. It allows users to input their sleep data, calculate the difference between their ideal and actual sleep, and provides a clear visual representation of their sleep debt, promoting better sleep habits and overall well-being. This project serves as a practical application of TypeScript and modern web development principles.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a JavaScript, CSS, and HTML project that provides a customizable and dynamic event calendar interface. This project allows users to easily display and manage events within a visually appealing calendar, and is built with modularity in mind, enabling easy integration into various web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository houses a modern IoT asset tracking application built with Next.js, TypeScript, and styled with Tailwind CSS. It leverages Supabase for backend services, providing a robust and scalable platform for tracking and managing assets in real-time. The project demonstrates a full-stack approach to IoT development, focusing on efficient data handling and a user-friendly interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for professional formatting and potentially complemented by HTML for online presentation. This project showcases my skills in document creation and web design while providing a clear and concise representation of my qualifications and experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (using the Pages Router), TypeScript, and Material UI (MUI) to serve as a centralized hub for developers. It leverages React Query for efficient data fetching and management, providing a smooth and organized experience. The project focuses on creating a customizable and extendable platform for tracking projects and resources.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface, built with JavaScript, Python, HTML, and CSS, for visualizing and interacting with data from the Robofleet robotics platform. This project provides a comprehensive dashboard solution focusing on real-time robot monitoring, data visualization, and potentially control functionalities, offering a user-friendly interface for managing and understanding robotic fleet operations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project management application built with Next.js, TypeScript, CSS, and JavaScript, providing a visual and intuitive platform for brainstorming, organizing, and prioritizing ideas within a team. This project utilizes modern web development practices to deliver a dynamic and user-friendly experience for streamlined project planning and execution.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-Voting is a project exploring decentralized voting systems built with Next.js, TypeScript, JavaScript, and styled with CSS. It aims to provide a secure and transparent voting platform, focusing on exploring blockchain-based solutions and user-friendly interfaces, as part of a larger investigation into secure and modern voting methodologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project built using HTML and Python focused on creating interactive map visualizations. It aims to leverage geographic data to present information in a clear and engaging way through a web-based interface. This repository showcases techniques for displaying data geographically, potentially using libraries like Folium or similar tools for map rendering and data integration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a web application built using Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting, designed as a CRUD (Create, Read, Update, Delete) project. This repository demonstrates a practical implementation of a full-stack application, showcasing how to connect a Python backend with a PostgreSQL database and create a user interface with HTML/CSS for managing data effectively.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a web-based project built using TypeScript, JavaScript, HTML, and CSS, designed to [**Insert Primary Function or Goal of the Project Here - e.g., \"provide a platform for users to connect and share travel experiences,\" or \"demonstrate a complex interactive data visualization,\" based on the actual project purpose gleaned from the README**]. The project focuses on [**Mention Key Feature or Topic from README Here - e.g., \"interactive maps and user-generated content,\" or \"dynamic filtering and data exploration**\"] and showcases modern web development techniques for creating [**Overall Project Type - e.g., \"a responsive and engaging user interface,\" or \"a powerful and scalable web application.\"**]\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting for efficiently visualizing and analyzing ROS (Robot Operating System) log files. This project provides a user-friendly interface to filter, search, and understand complex ROS log data, facilitating debugging and performance analysis in ROS-based robotic systems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern, interactive dashboard project built with TypeScript, JavaScript, and CSS, designed to provide a clean and efficient user interface for data visualization and management. This project leverages the power of Next.js to deliver a performant and scalable solution suitable for various data-driven applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript. It explores [mention main purpose of the project - you would get this from the README, e.g., \"serverless note-taking application\", \"real-time collaboration platform\", \"a personal portfolio website\"]. This repository demonstrates modern web development practices and covers topics related to [mention key functionalities or areas of focus from the README, e.g., \"serverless architecture\", \"real-time data synchronization\", \"responsive design and user experience\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite, and Express.js, leveraging the Gemini API to provide engaging and interactive AI-powered conversations. This project explores building a modern web application with a focus on type safety and efficient development, demonstrating the use of cutting-edge technologies for seamless communication with Google's Gemini API and delivering a rich user experience with HTML, CSS, and JavaScript.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains projects and code examples focused on applying Python to financial analysis. It explores various financial concepts and techniques through practical implementations, providing a hands-on learning resource for those interested in combining finance and programming.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a full-stack e-commerce project built with Next.js 14 (using the Pages Router), TypeScript, and React, leveraging MUI for a sleek UI and React Query for efficient data fetching. This project demonstrates a complete online store implementation, focusing on core e-commerce functionalities, and showcasing best practices for type-safe development with TypeScript and modern React patterns.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]