[
    {
        "title": "devboard",
        "description": "Devboard is a comprehensive project built with Next.js 14 (using the pages-router), TypeScript, and styled with MUI, serving as a modern web application boilerplate or starting point. It leverages React Query for efficient data fetching and management, providing a solid foundation for building scalable and performant web applications while showcasing best practices for integrating these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS for visualizing and interacting with Robofleet data. This project aims to provide a user-friendly dashboard for monitoring robot status, sensor data, and executing commands, offering a comprehensive overview of your robotic fleet and enabling efficient remote management within the realm of robotics projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This CRUD Expense Tracker, built with JavaScript, CSS, and HTML, provides a simple and intuitive way to manage personal finances. Utilizing Material-UI for a clean and responsive interface, the project allows users to easily add, edit, and delete expense entries, offering a practical application of CRUD operations and serving as a useful learning resource for web development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the LaTeX source and generated HTML output for my resume, showcasing my skills and experience. It serves as a project to manage and version control my resume, leveraging TeX for professional formatting and HTML for easy online sharing.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "raven-v2",
        "description": "Raven v2 is a project exploring modern web development techniques, built primarily using TypeScript and JavaScript. This repository showcases a [mention the project's main goal, e.g., streamlined task management application, a personal portfolio website, a proof-of-concept for a new UI framework]. It serves as a demonstration of [mention key features or technologies used, e.g., efficient state management, responsive design, advanced data visualization], and aims to provide a foundation for future projects or contribute to the understanding of current web development best practices.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It serves as a practical example of implementing a user interface with data fetching and dynamic routing within a Next.js application, demonstrating best practices for project structure and component design. This repository provides a foundation for developers looking to create their own dashboards or learn more about building robust web applications using the Next.js framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt. It allows users to track their sleep patterns, calculate their accumulated sleep debt based on their ideal sleep schedule, and provides a visual representation of their sleep data. This project serves as a practical application of TypeScript and modern web development technologies for personal wellness and time management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a project built with TypeScript, CSS, and JavaScript to provide a simple and intuitive platform for brainstorming and organizing ideas. This personal project allows users to create and manage boards for different ideas, fostering a space for capturing thoughts, planning projects, and facilitating collaborative brainstorming sessions. It aims to be a lightweight and flexible tool for project management and creative thinking.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js, TypeScript, CSS, and JavaScript, designed to provide a simple and intuitive platform for creating and participating in polls. This project focuses on delivering a seamless voting experience with a modern user interface, leveraging the power of Next.js for server-side rendering and efficient routing, aiming to be a versatile tool for decision-making and gathering opinions on various topics.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, PostgreSQL, HTML, and CSS. This project showcases the development of a web application, implementing Create, Read, Update, and Delete functionalities for managing data. It serves as a practical example of building web applications with Python and demonstrates the integration of front-end and back-end technologies with a relational database.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository contains a project focused on creating interactive map visualizations using HTML and Python. The project aims to display data geographically, allowing users to explore and understand spatial patterns. It leverages HTML for the front-end interface and Python for data processing and map generation, providing a dynamic and informative mapping solution.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Jupyter Notebooks written in Python, designed to explore and analyze financial data. It serves as a project-based learning resource for individuals interested in applying Python to finance, covering various topics such as portfolio optimization, stock market analysis, and potentially other quantitative finance strategies. The notebooks provide practical examples and code implementations for financial analysis techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT asset tracking web application built with Next.js, TypeScript, and styled with Tailwind CSS. Leveraging Supabase for backend services, the project provides a user-friendly interface for monitoring and managing assets through real-time data visualization and location tracking, demonstrating a practical application of cutting-edge web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a JavaScript-based project focused on creating a customizable and interactive event calendar. Built with HTML, CSS, and JavaScript, this repository provides a foundation for developers to implement a dynamic calendar with event management capabilities. It's designed to be easily adaptable and integrates well into existing web projects, making it a useful resource for anyone looking to add event scheduling functionality to their application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, CSS, JavaScript, HTML, Vite.js, and Express.js that leverages the Gemini API. This project aims to provide a user-friendly platform for interactive conversations powered by AI, showcasing a practical implementation of the Gemini API within a modern web development stack.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG World is a dynamic web-based project built using TypeScript, JavaScript, HTML, and CSS, exploring interactive elements and modern web development practices.  This repository showcases a specific project focused on [mention specific feature from README or infer from name, e.g., a simulated world experience, data visualization, or interactive game]. It serves as a learning ground and demonstration of front-end development skills with an emphasis on utilizing modern technologies to create engaging user experiences.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool designed for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and Shell scripting, this project provides a user-friendly interface for filtering, searching, and graphically representing ROS log data to aid in debugging and understanding robot system behavior. It offers a convenient way to gain insights from ROS logs, making it easier to identify issues and optimize robot performance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a fully functional e-commerce web application built with Next.js 14 (Pages Router) and TypeScript, showcasing a modern approach to online fruit sales. It utilizes Material UI (MUI) for a responsive and intuitive user interface, React Query for efficient data fetching and caching, and emphasizes strong type safety throughout the codebase. This project serves as a practical example for developers looking to learn and implement these technologies in a real-world e-commerce setting.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]