[
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-Dashboard is a web application built using JavaScript, Python, HTML, and CSS for visualizing and interacting with robotic fleet data. This project provides a user-friendly interface to monitor robot status, track mission progress, and analyze performance metrics in real-time, making it a valuable tool for managing and understanding complex robotic deployments. It falls under the umbrella of project-based work and aims to provide a comprehensive dashboarding solution for Robofleet systems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This repository hosts a simple CRUD (Create, Read, Update, Delete) expense tracker application built using JavaScript, HTML, and CSS, styled with Material-UI. It serves as a basic project demonstrating fundamental web development concepts and UI design principles for managing personal finances and tracking expenses.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a Next.js 14 project, built with TypeScript, CSS, and JavaScript, designed as a modern development dashboard using the pages-router. It leverages MUI for a clean and responsive UI, and utilizes React Query for efficient data fetching and state management. This project explores key concepts like component composition, API integration, and data handling within a robust Next.js 14 environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript, focusing on [mention the project's core purpose based on the README or assume it's a personal portfolio/project showcase if no specific information is available]. This repository serves as a showcase of [mention key features or skills highlighted in the project, e.g., modern web development techniques, specific UI/UX implementations, etc.]. It explores concepts related to [mention project topics, generally related to web development in this case].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It demonstrates best practices for structuring a Next.js application, incorporating server-side rendering and data fetching techniques, and creating a visually appealing user interface. This repository serves as a practical example and learning resource for developers interested in building dynamic web applications with Next.js.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project built with TypeScript, CSS, and JavaScript, designed as a dynamic idea board for brainstorming and organizing thoughts. Utilizing modern web development practices, this application allows users to easily create, visualize, and manage ideas within a project context, fostering teamwork and efficient project planning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built using Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting, designed as a learning project. It demonstrates fundamental web development concepts and showcases how to build a functional application with a relational database backend, providing a practical example of a Python-based project utilizing common web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project showcasing interactive map visualizations built using HTML and Python. This repository explores techniques for displaying geographical data and creating engaging visual representations on a map, allowing users to explore and understand spatial information. The project focuses on practical application of web technologies for geographic data visualization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Jupyter Notebooks using Python to explore and analyze financial data. Focused on various finance-related projects, the notebooks leverage Python's data analysis libraries to provide practical applications and insights into topics such as stock market analysis, portfolio optimization, and financial modeling. It serves as a hands-on resource for learning finance concepts through coding and practical examples.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "resume",
        "description": "This repository contains my resume, built using LaTeX for professional formatting and potentially rendered to HTML for web presentation. It serves as a project showcasing my skills and experience, allowing for easy modification and distribution in both print and digital formats. The repository highlights the power of TeX for creating structured documents and explores its integration with web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their sleep debt. This tool allows users to track their daily sleep hours and compare them against their ideal sleep schedule, providing insights into their accumulated sleep debt and promoting better sleep habits. This project is a practical application of TypeScript and demonstrates a simple approach to tracking and visualizing personal data.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a simple, web-based voting application built using Next.js, TypeScript, CSS, and JavaScript. This project allows users to create and participate in polls, showcasing fundamental web development concepts and best practices within the context of a practical voting system. It aims to be a clean and easily understandable example for learning and experimenting with modern web frameworks and technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project leveraging TypeScript, Vite.js, and Express.js to create an interactive web application powered by the Gemini API. This repository showcases a modern approach to building web applications, incorporating best practices with TypeScript for enhanced type safety and utilizing cutting-edge technologies like Vite for rapid development. It explores integrating AI conversational models into user-friendly interfaces, demonstrating practical applications of the Gemini API within a modern JavaScript ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT asset tracking application built with Next.js, TypeScript, and styled with Tailwind CSS. It leverages Supabase for backend services, providing real-time location updates and asset management capabilities. The project demonstrates a complete solution for tracking physical assets, combining frontend responsiveness with robust backend functionality, and serves as a practical example of a full-stack TypeScript application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a project showcasing a visually appealing and interactive event calendar built using JavaScript, CSS, and HTML. This repository provides a flexible and customizable solution for displaying events, potentially leveraging dynamic data sources for a real-time updating calendar. It serves as a practical example of front-end web development techniques and calendar implementations using core web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "Ros-log-viewer is a web-based tool designed to visualize and analyze ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and Shell scripting, this project provides a user-friendly interface for filtering, searching, and understanding ROS logs, aiding in debugging and performance analysis of robotic systems. It falls under the broader topic of ROS projects, offering a practical solution for developers working with robotic software.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a web-based project built with TypeScript, JavaScript, HTML, and CSS, designed to [mention project's primary purpose or a key feature]. This repository showcases [mention a specific technology implementation, like state management or UI framework, if applicable] and explores concepts related to [mention specific topics covered, e.g., interactive maps, data visualization, or user authentication].  Explore the code to see how these technologies work together to create a dynamic and engaging user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a fully functional e-commerce platform built with Next.js 14 (using the pages router), TypeScript, and React, showcasing a modern approach to online retail. Utilizing MUI for a responsive and intuitive user interface, the project leverages React Query for efficient data fetching and management, providing a type-safe and scalable solution for selling fruits online. This project serves as a practical example of building a complete e-commerce application with cutting-edge technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]