[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built with TypeScript, JavaScript, CSS, and HTML designed to help users visualize and manage their accumulated sleep debt. This interactive tool allows users to track their sleep schedule against their desired sleep goals, providing a clear understanding of their sleep deficit or surplus. Utilizing modern web technologies, it offers a user-friendly interface for monitoring and improving sleep habits.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack web application built with Next.js 14 (Pages Router) and TypeScript, designed to serve as a project management and collaboration tool. It leverages MUI for a polished UI, React Query for efficient data fetching, and covers key topics like project management, UI design, and modern web development best practices within a TypeScript environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX and HTML source code for my resume, serving as a practical project to showcase document generation skills and web development basics. It utilizes TeX for generating a professional-looking PDF resume and HTML for a web-based version, demonstrating proficiency in both typesetting and front-end development within the context of a real-world application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository contains a project focused on creating interactive map visualizations using HTML and Python. It leverages web technologies for front-end display and Python for data processing and backend logic (if applicable) to represent geographical data in a visually appealing and informative manner. The project explores techniques for rendering map data and potentially incorporating user interaction for enhanced exploration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a web-based CRUD application built with Python, Flask, and PostgreSQL, leveraging HTML, CSS, and Shell scripting for a complete and interactive user experience. This project demonstrates practical application development using these technologies and explores core concepts related to database interaction, web frameworks, and front-end design.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a web application built with Next.js, TypeScript, CSS, and JavaScript, designed to help users brainstorm, organize, and develop new project ideas. This project leverages a modern technology stack to provide a clean, intuitive interface for capturing thoughts, outlining concepts, and fostering collaborative idea generation, all within a central, easily accessible board.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript, CSS, and HTML-based project for creating and managing a dynamic and interactive event calendar. This repository provides a customizable solution for displaying events, enabling users to easily add, view, and modify event details through a user-friendly interface, making it a valuable tool for event planning and scheduling.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This project, built with Next.js, TypeScript, TailwindCSS, and Supabase, provides a comprehensive solution for IoT asset tracking. It leverages modern web technologies to create a user-friendly interface for monitoring and managing assets, offering features for real-time location updates, data visualization, and alert management. The application demonstrates a practical implementation of serverless functions, database interaction, and responsive design principles for a robust and scalable asset tracking system.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project showcasing a modern voting application built with Next.js, TypeScript, CSS, and JavaScript. This repository demonstrates a full-stack approach to creating a robust and user-friendly voting platform, covering topics related to front-end development, server-side rendering, and modern web application architecture. It provides a practical example of building interactive web experiences using cutting-edge technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern and responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It serves as a template for creating data-rich user interfaces, emphasizing clean code and efficient UI development. This repository provides a foundation for building custom dashboards and demonstrates best practices for structuring Next.js applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven v2 is a project built using TypeScript and JavaScript, aiming to [insert primary purpose based on README or project knowledge - e.g., provide a modern note-taking experience, demonstrate a full-stack web application architecture, etc.]. This repository showcases [mention key features or focuses, e.g., a responsive user interface, serverless backend, etc.] and serves as a practical example of [mention relevant topics, e.g., modern web development, component-based design, etc.].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool designed to visualize and analyze ROS (Robot Operating System) log files. Built using JavaScript, Python, HTML, CSS, and Shell scripting, this project provides a user-friendly interface for filtering, searching, and displaying ROS logs, making it easier to debug and understand robot behavior. The repository focuses on providing a convenient and efficient log analysis solution within the ROS ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a dynamic web project built with TypeScript, JavaScript, HTML, and CSS, focusing on [mention a specific purpose based on README - e.g., visualizing global data, creating an interactive world map, or showcasing travel experiences]. This repository explores [mention key topics or features - e.g., data visualization techniques, interactive mapping solutions, or frontend development best practices] using modern web technologies to create an engaging and informative user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a web application built with TypeScript, Vite, and Express.js that leverages the Gemini API to provide AI-powered conversational interactions. This project explores integrating cutting-edge AI capabilities into a user-friendly interface using modern web development technologies like TypeScript, CSS, JavaScript, and HTML, focusing on ease of deployment and a seamless user experience for engaging in insightful AI conversations.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains a collection of projects exploring financial concepts and analysis. It demonstrates practical applications of Python for tasks like portfolio optimization, risk management, and time series analysis of financial data. The aim is to provide hands-on examples for learning and applying Python in the field of finance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository houses a web-based interface, built with JavaScript, Python (likely for backend functionalities), HTML, and CSS, to visualize and interact with data from Robofleet-enabled robots and systems. This project provides a centralized dashboard for monitoring robot status, sensor data, and potentially control functionalities, falling under the general topic of robotics project implementation and data visualization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a comprehensive e-commerce platform built with Next.js 14 (Pages Router), TypeScript, and React, leveraging MUI for a responsive and intuitive user interface. This project utilizes React Query for efficient data fetching and management, providing a type-safe and scalable foundation for selling fresh produce online. Focused on delivering a seamless shopping experience, it explores modern web development practices within the context of an e-commerce application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]