[
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. This repository serves as a practical example for implementing common dashboard features and UI elements, focusing on clean code architecture and leveraging the benefits of Next.js for server-side rendering and optimal performance. It's a great resource for developers looking to learn and implement dashboard functionalities in their own projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a personal project built with TypeScript and JavaScript, focusing on [**Insert a concise description of the project's main function here - e.g., creating a note-taking application, building a data visualization dashboard, etc.**]. This repository showcases modern web development practices and explores [**Mention a key technology or concept utilized e.g., React/Redux state management, Node.js server-side logic, etc.**], demonstrating a practical application of project development principles.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-Debt-Tracker is a web application built with TypeScript, JavaScript, HTML, and CSS designed to help users track and manage their sleep debt. This project allows individuals to monitor their sleep patterns, calculate accumulated sleep debt based on desired sleep goals, and provides visualizations to understand sleep trends, making it easier to prioritize and improve sleep habits. This repository showcases best practices in TypeScript development and front-end web development techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository contains a web-based interface for visualizing and interacting with data from a Robofleet robotics system. Built using JavaScript, Python (likely for backend services), HTML, and CSS, this project provides a user-friendly dashboard to monitor robot status, sensor readings, and other relevant information, facilitating effective robot operation and management. The repository is a dedicated project focused on dashboard development within the Robofleet ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for the document's structure and styling, and HTML for potentially generating a web-viewable version. This project demonstrates my skills in document creation and web development, showcasing my professional experience and qualifications in a presentable and organized format.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project management application built with Next.js 14 (using the Pages Router), TypeScript, and Material UI (MUI). This repository showcases a modern development workflow utilizing React Query for efficient data fetching and state management, providing a practical example of building dynamic web applications with a strong focus on type safety and a component-based architecture.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project built with TypeScript, CSS, and JavaScript, designed as a dynamic idea board application. This project leverages modern web technologies to provide a platform for brainstorming, organizing, and prioritizing ideas within a team setting. It aims to streamline the ideation process and foster innovation through its intuitive interface and collaborative features.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, serves as a collection of finance-related projects and analyses. It explores various financial concepts and tools using Python, covering topics like portfolio optimization, stock analysis, and financial modeling, providing practical examples for learning and application in the finance domain.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack, real-time voting application built with Next.js, TypeScript, CSS, and JavaScript. This project explores modern web development practices, focusing on creating a dynamic and interactive user experience for managing and participating in polls. It demonstrates practical application of these technologies within the context of a voting system.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-driven project providing a customizable and interactive event calendar solution. Built with HTML, CSS, and JavaScript, this repository offers a functional and visually appealing calendar for managing and displaying events dynamically. Its primary focus is to provide a simple and efficient event management experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a modern web application built with Next.js, TypeScript, and Tailwind CSS for tracking IoT assets in real-time. Leveraging Supabase for backend services, the project provides a user-friendly interface to monitor device locations, status, and historical data. It serves as a comprehensive example of implementing a full-stack IoT asset management solution using cutting-edge web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository, built with HTML and Python, contains a project focused on map visualization. It leverages these technologies to create interactive and informative maps, potentially visualizing geographic data or displaying location-based information. The project demonstrates the application of web technologies and scripting languages for geographical data representation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting. This project demonstrates a functional web application, showcasing skills in backend development with Flask and database management using PostgreSQL, complemented by a user-friendly front-end interface. It serves as a practical example of building and deploying a complete Python-based web application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project built using TypeScript, JavaScript, HTML, and CSS to create an interactive web application. Focused on delivering a rich user experience, this repository showcases a modern approach to front-end development utilizing a robust combination of technologies for a dynamic and engaging interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite.js, and Express.js that leverages the Gemini API to provide intelligent and interactive conversations. This project explores the integration of large language models into web applications, demonstrating effective use of modern JavaScript frameworks, CSS for styling, and HTML for structure, making it a valuable resource for developers interested in building similar AI-powered applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built using JavaScript, Python, HTML, CSS, and shell scripting, it provides a user-friendly interface to parse, filter, and display ROS log data, facilitating debugging and performance analysis for ROS-based projects. This project focuses on improving the development workflow for ROS applications by offering a clear and interactive log viewing experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce project built with Next.js 14 (using the Pages Router), TypeScript, and React, leveraging MUI for a clean and responsive user interface. This repository showcases best practices for type-safe development and utilizes React Query for efficient data fetching and caching. The project demonstrates a practical implementation of e-commerce functionality, serving as a valuable learning resource for developers interested in Next.js, TypeScript, and modern web development techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]