[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web application built with JavaScript, Python, HTML, and CSS to visualize and interact with data from a Robofleet robotic system. This project focuses on creating an intuitive dashboard interface, likely providing real-time monitoring, control, and analysis capabilities for robotic operations connected to the Robofleet framework.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "crud-expense-tracker is a simple, responsive web application built with JavaScript, HTML, and CSS, leveraging Material-UI for a clean and intuitive user interface. This project provides a basic CRUD (Create, Read, Update, Delete) functionality for tracking personal expenses, allowing users to easily add, view, edit, and remove expense entries. It serves as a practical demonstration of fundamental web development concepts and Material-UI component usage.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack web application built with Next.js 14 (using the pages router), TypeScript, and Material UI (MUI) designed to serve as a project management and development dashboard. Leveraging React Query for efficient data fetching and management, the repository showcases a practical implementation of modern web development technologies and best practices for building robust and scalable applications. It's a learning resource and a template for jumpstarting your own projects with similar technology stacks.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, and PostgreSQL, leveraging HTML, CSS, and Shell scripting for a complete user experience. This project demonstrates a practical implementation of basic database operations within a web application framework, showcasing core Python development skills and principles. It serves as a hands-on example for learning about creating, reading, updating, and deleting data using a modern web stack.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository showcases a web-based map visualization project built using HTML and Python. It allows users to interact with geographical data, potentially displaying markers, heatmaps, or other visual elements on a map interface. The project demonstrates skills in front-end web development with HTML and back-end data processing and mapping using Python, falling under the general topic of project-based learning and data visualization.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "raven-v2",
        "description": "Raven v2 is a project built with TypeScript and JavaScript, aiming to [**Insert a brief, compelling description of the project's purpose based on its README or assumed functionality. For example: streamline task management, create a real-time collaborative whiteboard, or visualize data from a specific API.**]. This repository showcases best practices in modern web development using these languages and explores topics related to [**Mention specific relevant topics beyond just \"project\" based on the repository's focus. For example: state management, UI frameworks, or data visualization techniques.**].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project built using Next.js, TypeScript, CSS, and JavaScript to demonstrate a modern, interactive dashboard interface. This repository showcases best practices for building scalable and maintainable web applications with Next.js, focusing on a clean UI, efficient data handling, and a user-friendly experience. It serves as a practical example for developers looking to learn and implement Next.js in their own projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project built with TypeScript, CSS, and JavaScript, designed to provide a platform for brainstorming and organizing project ideas. This interactive idea board allows users to easily add, visualize, and prioritize concepts, fostering a dynamic environment for innovation and project planning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a web application built with TypeScript, JavaScript, HTML, and CSS to help users monitor and manage their sleep schedules and identify any accumulated sleep debt. This project allows users to input their sleep data and visualizes it to show trends, highlight deficits, and promote healthier sleep habits. It leverages TypeScript for robust development and is tagged under the topics of \"project\" and \"typescript\" on GitHub.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for professional formatting and potentially hosted or previewed using HTML. This project showcases my skills in document creation and presentation, utilizing TeX for typesetting and potentially integrating with web technologies. The repository serves as a central location for managing and updating my resume files.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a modern, real-time voting application built with Next.js, TypeScript, and CSS, focusing on providing a streamlined and intuitive voting experience. It leverages Next.js features for server-side rendering and API routes to handle voting logic and data persistence, offering a performant and scalable solution for various voting scenarios. This project showcases best practices in Next.js development and demonstrates effective use of TypeScript for type safety and maintainability.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Python-based Jupyter Notebook projects focused on financial analysis and modeling. Using Python libraries, the projects explore various financial concepts and techniques, offering practical examples and code for individuals interested in applying Python to finance-related challenges and learning financial concepts through programming.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a full-stack IoT asset tracking application built with Next.js, TypeScript, and Supabase. Utilizing Tailwind CSS for styling, the project demonstrates a modern approach to real-time location monitoring and management, providing a foundation for building custom IoT solutions. It serves as a practical example of integrating a front-end framework with a robust back-end service for asset tracking purposes.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "This project provides a dynamic and customizable event calendar built with JavaScript, CSS, and HTML. It allows users to easily add, view, and manage events, offering a user-friendly interface for scheduling and organization. Designed for flexibility and integration, this calendar can be readily implemented into various web applications and projects, focusing on enhancing event management capabilities.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Express.js, and Vite, leveraging the Gemini API to provide interactive and engaging conversations. This project explores the integration of AI conversational models within a modern web framework, utilizing CSS, JavaScript, and HTML for a dynamic and user-friendly experience. It showcases a practical implementation of AI-powered communication within a streamlined and efficient development environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a personal project exploring web development techniques using TypeScript, JavaScript, HTML, and CSS. This repository serves as a playground to experiment with modern front-end technologies and build interactive user interfaces, focusing on applying fundamental programming concepts within a practical project context. It aims to showcase skills and serve as a learning resource for aspiring web developers.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool for visualizing and analyzing ROS (Robot Operating System) log files. Built using JavaScript, Python, HTML, CSS, and Shell scripting, it provides an interactive interface to filter, search, and understand ROS logs, aiding in debugging and performance analysis of robotic systems. This project aims to simplify log data interpretation within the ROS ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a modern e-commerce platform built with Next.js 14 (using the Pages Router), TypeScript, and styled with Material UI (MUI). This project leverages React Query for efficient data fetching and management, providing a type-safe environment for selling fruits online. It serves as a comprehensive example of a full-stack web application demonstrating best practices in contemporary web development using a robust and performant tech stack.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]