[
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a web application built with TypeScript, JavaScript, HTML, and CSS to help users visualize and manage their sleep debt over time. This project, tagged under the 'typescript' topic, allows users to input their sleep data and provides insightful visualizations to track their accumulated sleep deficit, promoting better sleep habits and overall well-being.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, built using LaTeX for professional formatting and potentially incorporating HTML for online accessibility. It serves as a practical project showcasing document creation and web development skills, focusing on presenting my qualifications and experience in a clear and effective manner.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository hosts a project focused on map visualization, built using HTML and Python. It leverages web-based technologies to display and interact with geographical data, aiming to provide an intuitive and informative way to explore location-based information. The project demonstrates the integration of frontend and backend elements for creating interactive map applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python and Flask, utilizing PostgreSQL for data storage. This project demonstrates a functional web application incorporating HTML, CSS, and shell scripting for deployment and management, serving as a practical example of developing and deploying a Python-based web application with database integration.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack project built with Next.js 14 (using the pages router), TypeScript, and Material UI (MUI) to provide a customizable dashboard template for developers. It leverages React Query for efficient data fetching and management, offering a solid foundation for building robust and scalable web applications. This repository serves as a practical example and starting point for projects utilizing these technologies and common development patterns.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository houses a web-based interface for monitoring and managing robotic fleets, built using JavaScript, Python, HTML, and CSS. This project provides a comprehensive dashboard solution for visualizing robot status, tracking progress, and controlling robot actions, making it a valuable tool for robotics projects and fleet management applications. The dashboard leverages a combination of front-end and back-end technologies to deliver a real-time, interactive experience for users.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a project built with TypeScript, CSS, and JavaScript, offering a visual and interactive platform to brainstorm, organize, and prioritize ideas. This Kanban-style board allows users to easily create, categorize, and move ideas across different stages, fostering collaborative thinking and efficient project management. It provides a simple yet powerful tool for individuals and teams seeking to structure their brainstorming sessions and translate concepts into actionable plans.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project showcasing a fully functional and customizable event calendar built with JavaScript, CSS, and HTML. This repository provides a dynamic and interactive interface for managing and displaying events, offering a user-friendly solution for project planning and scheduling applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern web application built with Next.js, TypeScript, TailwindCSS, and Supabase, designed for tracking IoT assets. It provides a user-friendly interface for monitoring location, status, and other relevant data from connected devices, serving as a practical project demonstrating full-stack development with cutting-edge technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project showcasing a modern voting application built with Next.js, TypeScript, CSS, and JavaScript. This repository provides a functional implementation of a voting system, demonstrating key web development concepts and best practices within the Next.js framework. It serves as a practical example for learning about project structure, front-end development, and user interface design.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripting designed to visualize and analyze ROS (Robot Operating System) log files. This project provides a user-friendly interface for filtering, searching, and graphically representing ROS log data, enabling developers to efficiently debug and understand their ROS-based systems. It's focused on providing a clear and insightful view into ROS logging, making it an invaluable resource for ROS project development and debugging.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a dynamic web project built with TypeScript, JavaScript, HTML, and CSS, focusing on [mention the core purpose of the project from the README, e.g., visualizing data, creating an interactive game, or building a specific application]. This repository houses the codebase for the project, showcasing implementation using modern web development practices and serving as a platform for [mention the goal of the repository, e.g., collaboration, learning, or showcasing portfolio work].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project built using TypeScript, CSS, and JavaScript, showcasing a modern and responsive dashboard interface developed with the Next.js framework. It provides a foundational structure for building data-driven web applications, demonstrating best practices in component architecture, state management, and styling within a Next.js environment. This repository serves as a practical example and a learning resource for developers interested in creating interactive and dynamic dashboards using cutting-edge web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project showcasing modern web development practices using TypeScript and JavaScript. This repository explores [mention a specific feature or goal from the README if available, e.g., real-time data visualization or a specific architectural pattern] and serves as a learning resource or a foundation for similar projects. It delves into key concepts related to project structure, code organization, and utilizing the power of TypeScript for robust and maintainable code.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite, Express.js, and utilizing the Gemini API to provide users with an interactive AI assistant. This project explores the integration of large language models for conversational AI, leveraging modern web development practices and technologies like CSS, JavaScript, and HTML for a dynamic and engaging user experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains a collection of projects exploring various aspects of finance. It serves as a practical learning resource for applying Python to financial analysis, modeling, and data visualization. Topics covered likely include portfolio optimization, risk management, time series analysis, and potentially algorithmic trading, all demonstrated through clear and concise code examples.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a full-stack e-commerce web application built with Next.js 14 utilizing TypeScript, React, and Material UI (MUI) for a modern and responsive user interface. This project, leveraging the pages-router approach, demonstrates best practices in building dynamic and type-safe web applications, incorporating React Query for efficient data fetching and management. It serves as a practical example for developers looking to build similar e-commerce platforms with a focus on clean architecture and maintainability.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]