[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface, built with JavaScript, Python, HTML, and CSS, designed to visualize and interact with data from a robotic fleet. This project aims to provide a user-friendly dashboard for monitoring robot status, analyzing performance, and potentially controlling aspects of the robotic system, falling under the broad topic of \"project\" development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This expense tracker project, built with JavaScript, CSS, and HTML, provides a user-friendly CRUD (Create, Read, Update, Delete) interface for managing personal finances. Leveraging Material-UI for a clean and responsive design, this application allows users to easily add, view, edit, and remove expense entries, helping them stay on top of their spending.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a personal project management dashboard built with Next.js 14 (pages router), TypeScript, and Material UI (MUI). It utilizes React Query for efficient data fetching and aims to provide a streamlined interface for organizing tasks and tracking project progress, leveraging modern web development practices and focusing on clean, maintainable code.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built with TypeScript and JavaScript, aiming to [mention project's specific aim - e.g., provide a modern note-taking application, offer a simplified project management solution, etc.]. This repository focuses on demonstrating [mention the main topics or principles covered by the project - e.g., clean architecture, reactive programming, serverless deployment, etc.] while showcasing practical application of these technologies in a real-world context.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern and responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. This repository serves as a practical example of implementing dynamic data fetching, UI components, and routing within a Next.js application, providing a solid foundation for building complex web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, HTML, and CSS to help users visualize and manage their sleep debt. It provides a simple interface to log sleep hours and track the cumulative difference between recommended and actual sleep, aiming to promote healthier sleep habits. This repository showcases a practical application of TypeScript and modern web development techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next Idea Board is a collaborative project built with TypeScript, CSS, and JavaScript designed to facilitate brainstorming and project planning. It allows users to easily capture, organize, and share ideas in a visually appealing and interactive board format. This repository serves as a central hub for development and contributions to this project management tool.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-Voting is a modern, decentralized voting application built using Next.js, TypeScript, CSS, and JavaScript. This project leverages blockchain principles for secure and transparent voting processes. Focusing on project-based learning, this repository showcases a practical implementation of web development technologies in a real-world scenario.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository contains a collection of Jupyter Notebooks exploring various financial concepts and analyses using Python. It serves as a project-based learning resource, demonstrating how to apply Python programming to real-world financial problems, including data analysis, portfolio optimization, and potentially other financial modeling tasks. The notebooks provide practical examples and code snippets for those interested in combining finance and programming.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code and generated HTML output for my resume. It serves as a project demonstrating my skills in typesetting with LaTeX to create a visually appealing and professional resume, which is then compiled into a web-friendly HTML version.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "jovian",
        "description": "Jovian is a full-stack CRUD application built with Python, Flask, and PostgreSQL, designed to manage and interact with data efficiently. Leveraging HTML, CSS, and Shell scripting for a complete web experience, this project demonstrates best practices in web development, encompassing topics like database management, API development, and user interface design. It serves as a practical example for learning and implementing robust Python web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project utilizing HTML and Python to create interactive map visualizations. This repository explores techniques for displaying geographical data, likely focusing on presenting location-based information in a user-friendly and visually appealing format. The project demonstrates practical application of web development and data visualization principles within the context of mapping.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a dynamic web application built with TypeScript, ViteJS, ExpressJS, CSS, JavaScript, and HTML, leveraging the Gemini API to provide an interactive and insightful conversational experience. This project explores the capabilities of the Gemini API within a modern web framework, showcasing best practices in TypeScript development, frontend design, and backend API integration, all while offering users a unique and engaging AI-powered interaction.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project demonstrating modern web development techniques using TypeScript, JavaScript, HTML, and CSS. This repository explores [insert brief, compelling project goal or feature from README, e.g., interactive 3D world visualization, a dynamic single-page application, etc.]. It serves as a practical showcase for combining these technologies to create a [describe the output, e.g., responsive and engaging user experience, data-driven application, etc.], falling under the project category.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern IoT Asset Tracking application built with Next.js, TypeScript, and styled with Tailwind CSS. It leverages Supabase for backend services and database management, offering a comprehensive project demonstrating real-time asset monitoring and management capabilities. The project focuses on providing a user-friendly interface for tracking assets, visualizing their location, and managing associated data using a performant and scalable architecture.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project showcasing a dynamic and interactive event calendar built using JavaScript, CSS, and HTML.  This repository provides a customizable and responsive calendar solution that allows users to easily display and manage events, dates, and associated information, serving as a practical example of front-end web development principles.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "Ros-log-viewer is a web-based tool for visualizing and analyzing log data generated by Robot Operating System (ROS) applications. Built using JavaScript, Python, HTML, CSS, and Shell scripting, this project provides a user-friendly interface for filtering, searching, and displaying ROS log messages, aiding in debugging and understanding robot behavior. It focuses on providing a convenient way to parse and present the often verbose output of ROS systems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a modern e-commerce platform built with Next.js 14 utilizing the Pages Router, TypeScript, and MUI. This project demonstrates a fully functional online store for selling fruit, showcasing best practices in front-end development with React Query for efficient data fetching and type safety throughout the application. It serves as a practical example of building robust and scalable e-commerce applications with a focus on clean code and developer experience.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]