[
    {
        "title": "devboard",
        "description": "DevBoard is a full-stack project management application built with Next.js 14 (pages router), TypeScript, and Material UI (MUI). It leverages React Query for efficient data fetching and management, showcasing a modern approach to web development with a focus on creating a collaborative and organized development environment. The repository provides a comprehensive example of implementing project management features using these technologies, offering valuable insights into best practices and patterns.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript, focused on [Insert a specific purpose if available in the README, otherwise use a general purpose like \"solving a particular problem\" or \"creating a useful tool\"]. This repository contains the codebase for [mention a key feature or component if available, otherwise omit this]. It explores [Mention a key area the project addresses, derived from README or topics, e.g., \"modern web development techniques\" or \"efficient data processing\"].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project showcasing a modern, responsive dashboard built with Next.js, TypeScript, CSS, and JavaScript. It serves as a practical example for learning and implementing dashboard layouts, data visualization, and server-side rendering using Next.js best practices. This repository provides a foundation for building scalable and performant web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-Dashboard is a web-based interface built with JavaScript, Python, HTML, and CSS for visualizing and interacting with data from robotic fleets. This project aims to provide a comprehensive dashboard solution, enabling users to monitor robot status, control robot operations, and analyze fleet performance.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "This is a simple CRUD expense tracker application built using JavaScript, CSS, and HTML, leveraging Material-UI for a clean and intuitive user interface. The project allows users to add, read, update, and delete expense records, providing a basic framework for managing personal finances and serving as a practical example of CRUD operations in a web application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project management tool built with TypeScript, CSS, and JavaScript, allowing users to brainstorm, organize, and prioritize ideas within a visually appealing and interactive board. This repository houses the code for a web application designed to streamline the creative process, making it easier to manage projects from conception to execution.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a Python-based CRUD application built with Flask and PostgreSQL, providing a foundation for managing data through create, read, update, and delete operations. This project showcases the integration of HTML, CSS, and Python within a Flask framework, offering a practical example for learning and implementing web applications with relational databases. It serves as a starting point for building more complex web projects and demonstrates best practices for structuring a Flask application.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project utilizing HTML and Python to create interactive map visualizations. This repository demonstrates the use of web technologies and scripting to present geographical data in a user-friendly and informative manner, focusing on practical application of data visualization techniques.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code for my resume, which is compiled into a visually appealing and professional PDF. It also includes an HTML version of the resume for online viewing and easy accessibility. The project showcases my skills in TeX typesetting and web development for personal branding and professional presentation.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep-debt-tracker is a project built using TypeScript, JavaScript, HTML, and CSS to help users track and manage their sleep debt. This application aims to provide insights into sleeping patterns and facilitate better sleep habits, leveraging modern web technologies for a user-friendly experience. This repository demonstrates practical application of TypeScript in a real-world project.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a web-based project built with TypeScript, JavaScript, HTML, and CSS. This repository showcases [Insert main functionality of the project based on README - e.g., an interactive globe visualization, a data dashboard, or a simple game].  It's a demonstration of [Mention a key aspect like data visualization, front-end development skills, or project implementation experience].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a modern web application built with Next.js, TypeScript, and Tailwind CSS for tracking IoT assets in real-time. Leveraging Supabase for backend services, the project showcases a robust solution for visualizing and managing asset location data, incorporating key technologies like Next.js, TypeScript, and focuses on providing a streamlined user experience through its well-designed interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-based project creating a customizable and interactive event calendar web application. Built using HTML, CSS, and JavaScript, this repository provides a foundation for displaying and managing events in a visually appealing and user-friendly manner. The calendar can be dynamically populated with event data, offering features like event creation, editing, and display within a responsive design.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack, decentralized voting application built with Next.js, TypeScript, CSS, and JavaScript. This project leverages blockchain technology for secure and transparent voting, allowing users to create and participate in polls with confidence. Key features include user authentication, vote creation and submission, and real-time result updates, all within a user-friendly interface. This project exemplifies a practical application of blockchain for voting and serves as a template for building similar secure and transparent applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, Vite.js, Express.js, HTML, CSS, and JavaScript, leveraging the Gemini API to provide users with an interactive AI-powered conversational experience. This project explores the integration of AI capabilities with modern web development practices, encompassing topics like API integration, front-end reactivity, and back-end server logic for a dynamic and engaging user interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebook and Python, contains a project focused on exploring financial concepts and analysis through practical coding examples. It demonstrates how to leverage Python's data science capabilities for financial modeling, data visualization, and potentially algorithmic trading strategies, offering a hands-on learning experience in finance with Python.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built with JavaScript, Python, HTML, CSS, and Shell scripts designed to visualize and analyze log data generated by ROS (Robot Operating System) systems. This project simplifies debugging and performance monitoring by providing a user-friendly interface to browse, filter, and understand ROS logs, falling under the broader project topic of improving ROS development workflows.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce project built with Next.js 14 (using the pages router), TypeScript, and MUI for a modern and type-safe user experience. This repository showcases a functional online fruit store, leveraging React Query for efficient data fetching and management. Explore this project to learn about building e-commerce applications with these technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]