[
    {
        "title": "devboard",
        "description": "Devboard is a Next.js 14 project built with TypeScript, leveraging the Pages Router for routing and React Query for efficient data fetching and caching. This project, styled with CSS and incorporating Material UI (MUI) components, aims to provide a foundational development board or template for quickly bootstrapping new web applications with a modern, well-structured, and type-safe codebase.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a project leveraging TypeScript, CSS, and JavaScript to build a decentralized voting platform using Next.js. This repository contains the codebase for a secure and transparent voting system, focusing on a clean user interface and robust backend architecture, exploring modern web development best practices in the realm of decentralized applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a personal project built with TypeScript, JavaScript, CSS, and HTML to help users visualize and manage their accumulated sleep debt. This application allows users to log their sleep and wake times, calculates their sleep debt, and provides a clear graphical representation of their sleep patterns, aiming to promote better sleep hygiene and overall well-being. The project serves as a practical demonstration of TypeScript and front-end web development principles.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-Idea-Board is a project showcasing a dynamic and interactive idea board built with Next.js, leveraging TypeScript for type safety, CSS for styling, and JavaScript for core functionality. This project allows users to brainstorm, organize, and visualize ideas collaboratively, and demonstrates best practices for building modern web applications with a focus on clean code, efficient performance, and a user-friendly interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web application built with JavaScript, Python (likely for backend services or data processing), HTML, and CSS. This project aims to provide a user interface, likely a dashboard, for visualizing and interacting with data or functionalities related to RoboFleet, suggesting a focus on robotics, fleet management, or related automation systems. The project utilizes a combination of frontend and backend technologies to create an interactive experience for monitoring and controlling a RoboFleet deployment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a project providing a web-based interface for visualizing and analyzing ROS (Robot Operating System) log files. Built with JavaScript, Python, HTML, CSS, and Shell scripting, this tool aims to offer a user-friendly experience for filtering, searching, and understanding ROS logs, ultimately aiding in debugging and improving robot system performance. It focuses on enhancing ROS development workflows by making log data more accessible and manageable.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built using Jupyter Notebooks and Python, contains a collection of projects focused on applying Python to financial analysis and modeling. It explores various finance-related topics, providing practical examples and implementations for tasks such as portfolio optimization, risk management, and data analysis using Python's powerful libraries. The projects aim to provide a hands-on learning experience for anyone interested in leveraging Python for financial applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "Map-Visualisation",
        "description": "Map-Visualisation is a project built using HTML and Python to create interactive and insightful map visualizations. This repository showcases techniques for displaying geographical data, likely incorporating data analysis and manipulation in Python to generate dynamic web-based maps rendered with HTML.  It serves as a practical example of combining front-end and back-end technologies for data visualization and spatial analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "jovian",
        "description": "Jovian is a CRUD application built with Python, Flask, PostgreSQL, HTML, CSS, and Shell scripting, designed as a project demonstrating fundamental web development skills. This repository showcases a functional application with create, read, update, and delete operations, leveraging the Flask framework for backend logic and PostgreSQL for database management, providing a practical example for learning and understanding full-stack development concepts.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack project built with TypeScript, CSS, JavaScript, HTML, Express.js, and Vite.js, that leverages the Gemini API to provide an interactive and engaging experience. It explores the integration of large language models into web applications and showcases practical implementation using modern web development technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern, interactive dashboard project built with Next.js, TypeScript, CSS, and JavaScript, designed to showcase best practices for creating dynamic and responsive web applications. This repository serves as a practical example of utilizing these technologies to build a functional dashboard interface, focusing on clean code, maintainability, and efficient data handling, making it a valuable resource for learning and implementing similar projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript, focusing on [mention project's core functionality or aim based on the README file if available, otherwise describe as a personal or learning project]. This repository serves as a [personal/learning project] exploring [mention key technologies or techniques used, e.g., advanced TypeScript features, specific JavaScript libraries, or architectural patterns].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX and HTML source code for my resume, serving as a project to showcase professional experience and skills. It leverages TeX for generating a clean and structured PDF version, and HTML for a web-friendly online presentation. This project demonstrates document generation and web presentation using different technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "Dynamic-event-calendar is a JavaScript-based project that creates a customizable and interactive event calendar using HTML and CSS for the front-end. This repository provides a foundation for building dynamic calendars capable of displaying, managing, and interacting with event data, making it suitable for personal scheduling or integration into larger web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository contains a Next.js project built with TypeScript, TailwindCSS, and Supabase, designed for tracking IoT assets. It leverages Supabase for backend services and real-time data management, providing a user-friendly interface (styled with TailwindCSS) to monitor and manage IoT device locations and statuses. The project demonstrates a modern approach to asset tracking using serverless technologies and a component-based architecture, perfect for learning or adapting to similar IoT application needs.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a project showcasing a dynamic and interactive web experience, built using TypeScript, JavaScript, HTML, and CSS. This repository focuses on implementing and exploring modern web development techniques to create a visually appealing and engaging interface, focusing on [mention specific functionality from README if available, e.g., data visualization, interactive map, etc.]. It serves as a demonstration of project-based learning and practical application of core front-end technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-seller is a modern e-commerce web application built with Next.js 14 (using the Pages Router), TypeScript, and React. Leveraging the power of Material UI (MUI) for a responsive and intuitive user interface, it utilizes React Query for efficient data fetching and management. This project showcases best practices for building type-safe and performant e-commerce platforms, serving as a valuable resource for developers interested in learning about or contributing to similar projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]