[
    {
        "title": "robofleet-dashboard",
        "description": "The robofleet-dashboard repository hosts a web-based interface built with JavaScript, Python, HTML, and CSS for interacting with and visualizing data from Robofleet, a robotics fleet management system. This project focuses on providing users with a clear and intuitive dashboard to monitor robot status, manage tasks, and gain insights into fleet performance. The dashboard leverages web technologies to offer real-time data updates and user-friendly controls for efficient robot fleet management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "crud-expense-tracker",
        "description": "crud-expense-tracker is a simple and intuitive web application built with JavaScript, CSS, and HTML, utilizing Material-UI for a clean and responsive user interface. This project demonstrates fundamental CRUD (Create, Read, Update, Delete) operations by allowing users to track their expenses, providing a practical example of front-end development and project structuring.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/crud-expense-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/crud-expense-tracker",
        "liveLink": "https://moovmint.vercel.app"
    },
    {
        "title": "devboard",
        "description": "Devboard is a Next.js 14 project built with TypeScript, leveraging the Pages Router for routing and MUI for a clean and responsive UI. This project serves as a development board or dashboard, demonstrating best practices and utilizing modern technologies such as React Query for efficient data fetching and management. It explores key concepts related to project structure, state management, and UI component implementation within a Next.js and TypeScript ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built with TypeScript and JavaScript, aiming to [**Insert brief project purpose - e.g., streamline task management, provide a modern UI framework, etc. - based on the actual project from the README or your understanding**]. This repository houses the codebase for [**Mention the core component or feature, e.g., the frontend application, the API server, etc.**], leveraging modern web development practices and design principles. It's a practical implementation showcasing [**Mention key project aspects, e.g., component-based architecture, efficient data handling, etc.**] relevant to the \"project\" topic on GitHub.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a project built with TypeScript, CSS, and JavaScript, showcasing a modern dashboard implementation using Next.js. This repository serves as a practical example for learning and implementing dashboard functionalities, focusing on efficient data visualization, user interface design, and leveraging the capabilities of the Next.js framework. It aims to provide a foundation for building scalable and performant web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project built with Next.js (TypeScript, CSS, and JavaScript) designed to facilitate brainstorming and idea organization. This interactive platform allows users to easily add, organize, and vote on ideas, making it ideal for project teams looking to foster creativity and efficiently manage their innovative concepts.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a web application built with TypeScript, JavaScript, CSS, and HTML designed to help users monitor and manage their sleep debt. This project provides a visual and interactive way to track sleep patterns, identify potential sleep deficits, and promote healthier sleep habits. It's a practical demonstration of TypeScript usage in a front-end project, focused on improving personal well-being.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a web-based CRUD application built with Python, Flask, and PostgreSQL, utilizing HTML, CSS, and Shell scripting for a full-stack implementation. This project explores practical application of core web development technologies and demonstrates a functional system for creating, reading, updating, and deleting data entries, serving as a learning resource and template for similar Python-based web projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository hosts a project focused on map visualization, leveraging HTML for the front-end interface and Python for data processing and backend logic (if applicable). The project, built with HTML and Python, likely aims to display geographical data on interactive maps, exploring concepts within data visualization and project development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "resume",
        "description": "This repository contains the TeX source code and generated HTML for my resume. It serves as a personal project showcasing my skills in typesetting with LaTeX to create a professional and visually appealing resume, which is then rendered into an accessible HTML format. The project focuses on presentation and organization of skills and experience, ultimately aimed at providing a clear and concise overview of my qualifications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack web application built with Next.js (TypeScript, JavaScript, and CSS) for creating and participating in polls and voting. This project focuses on providing a user-friendly and efficient platform for gathering opinions and making decisions, encompassing topics related to project development and interactive web applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "atg-world is a web-based project built using TypeScript, JavaScript, HTML, and CSS. It explores and showcases interactive functionalities and dynamic content rendering, focusing on project-related tasks and demonstrations. This repository serves as a learning platform and portfolio piece to showcase front-end development skills and explore modern web technologies.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a full-stack IoT asset tracking web application built with Next.js, TypeScript, and Supabase. It utilizes Tailwind CSS for styling and focuses on providing a user-friendly interface for monitoring and managing asset locations in real-time. The project showcases a modern approach to IoT data visualization and management, leveraging serverless functions and database-as-a-service for scalability and maintainability.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project showcasing a dynamic and interactive event calendar built using JavaScript, CSS, and HTML. This repository provides a customizable and user-friendly interface for displaying and managing events, focusing on flexibility and ease of integration. The project aims to demonstrate effective front-end development techniques and provides a foundation for building more complex calendar applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool designed to visualize and analyze ROS (Robot Operating System) log files, built using JavaScript, Python, HTML, CSS, and shell scripting. This project facilitates easier debugging and monitoring of ROS-based systems by providing a user-friendly interface to filter, search, and explore log data, making it an essential tool for robotics developers working with ROS.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, contains a collection of projects focused on applying Python to financial analysis and modeling. It serves as a practical resource for learning how to leverage Python's capabilities in areas like portfolio optimization, risk management, and financial data analysis.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a full-stack web application built with TypeScript, leveraging Express.js for the backend, the Gemini API for AI functionality, Vite.js for a fast frontend development experience, and styled with CSS and HTML. This project explores integrating AI capabilities into a modern web interface and serves as a learning platform showcasing best practices in TypeScript-based web development.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "fruit-seller",
        "description": "fruit-seller is a modern e-commerce platform built with Next.js 14 (using the Pages Router), TypeScript, and React. It leverages MUI for a polished user interface and React Query for efficient data fetching and caching. This project demonstrates best practices for type-safe development and explores key e-commerce features within a Next.js environment.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]