[
    {
        "title": "robofleet-dashboard",
        "description": "Robofleet-dashboard is a project showcasing a dynamic and interactive web interface built with JavaScript, Python, HTML, and CSS. This dashboard provides a user-friendly visual representation of data related to Robofleet, likely focusing on monitoring, control, and reporting aspects. The project aims to offer a clear and intuitive way to interact with Robofleet data, facilitating improved understanding and management.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/robofleet-dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/robofleet-dashboard",
        "liveLink": "https://robofleet-dashboard.vercel.app"
    },
    {
        "title": "NextJs-Dashboard",
        "description": "NextJs-Dashboard is a modern web application built with Next.js, TypeScript, CSS, and JavaScript, serving as a project to demonstrate and explore the capabilities of these technologies in creating interactive and dynamic user interfaces. This repository showcases best practices in front-end development, offering a functional dashboard example suitable for learning and adaptation in various projects.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/NextJs-Dashboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/NextJs-Dashboard",
        "liveLink": "https://aayushsiwa-dashboard.vercel.app"
    },
    {
        "title": "raven-v2",
        "description": "Raven-v2 is a project built using TypeScript and JavaScript, focusing on [Insert primary function/purpose from README if available, e.g., creating a modern note-taking application]. This repository showcases [Mention key features/goals from README if available, e.g., real-time collaboration and offline support] leveraging modern web development techniques and best practices.  It serves as a demonstration of [Mention what it showcases, e.g., a full-stack application architecture or specific TypeScript patterns].\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/raven-v2/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/raven-v2",
        "liveLink": ""
    },
    {
        "title": "sleep-debt-tracker",
        "description": "Sleep Debt Tracker is a project built with TypeScript, JavaScript, CSS, and HTML that helps users monitor and manage their sleep debt. This repository utilizes modern web development practices to provide a user-friendly interface for tracking sleep patterns and identifying potential sleep deficits, making it a valuable tool for improving overall sleep health.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/sleep-debt-tracker/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/sleep-debt-tracker",
        "liveLink": "https://napTrack.vercel.app"
    },
    {
        "title": "next-idea-board",
        "description": "Next-idea-board is a collaborative project built with TypeScript, CSS, and JavaScript for brainstorming and organizing ideas within a team. It provides a visual and interactive idea board, allowing users to easily add, categorize, and prioritize suggestions, fostering a more efficient and structured ideation process. This project showcases practical application of modern web technologies in a user-friendly interface.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-idea-board/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-idea-board",
        "liveLink": "https://next-idea-board.vercel.app"
    },
    {
        "title": "resume",
        "description": "This repository contains the source code for my resume, implemented using TeX for beautiful formatting and potentially utilizing HTML for online presentation or integration with a personal website. This project showcases my resume in a professional and customizable format, demonstrating proficiency in TeX typesetting and web development basics within the broader \"project\" category.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/resume/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/resume",
        "liveLink": "https://aayushsiwa.github.io/resume/resume.pdf"
    },
    {
        "title": "devboard",
        "description": "Devboard is a full-stack web application built with Next.js 14 (Pages Router), TypeScript, and Material UI (MUI), designed as a project management and collaboration tool. It utilizes React Query for efficient data fetching and caching, providing a streamlined and responsive user experience for managing tasks and projects. This repository showcases a modern approach to web development, leveraging best practices and popular libraries within the React ecosystem.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/devboard/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/devboard",
        "liveLink": "https://devboard-pi.vercel.app"
    },
    {
        "title": "next-voting",
        "description": "Next-voting is a full-stack, real-time voting application built with Next.js, TypeScript, and Tailwind CSS. This project allows users to create and participate in polls, offering a dynamic and engaging voting experience. It leverages modern web development practices and focuses on providing a user-friendly interface for efficient and secure voting.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/next-voting/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/next-voting",
        "liveLink": "https://next-voting.vercel.app"
    },
    {
        "title": "dynamic-event-calendar",
        "description": "dynamic-event-calendar is a project showcasing a fully functional, interactive, and dynamic event calendar built using JavaScript, CSS, and HTML. This repository provides a customizable solution for displaying and managing events, allowing users to easily navigate through dates, view event details, and potentially add or modify entries. It serves as a practical demonstration of front-end development skills and provides a foundation for building more complex calendar applications.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/dynamic-event-calendar/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/dynamic-event-calendar",
        "liveLink": "https://calendar-as.vercel.app"
    },
    {
        "title": "iot-asset-tracking",
        "description": "This repository hosts a modern, full-stack IoT asset tracking application built with Next.js, TypeScript, Supabase, and Tailwind CSS. It provides a user-friendly interface for managing and monitoring the location of assets using real-time data, leveraging a Supabase backend for authentication and data storage. The project showcases best practices in modern web development and is a valuable resource for learning about serverless architectures, real-time data visualization, and building scalable IoT solutions.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/iot-asset-tracking/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/iot-asset-tracking",
        "liveLink": "https://iot-asset-tracking.vercel.app"
    },
    {
        "title": "genietalks",
        "description": "GenieTalks is a dynamic web application leveraging TypeScript, Vite, and Express.js to provide an interactive platform built on the Gemini API. This project explores the power of modern web development technologies in conjunction with cutting-edge AI, offering users a unique and engaging experience. The repository showcases best practices in TypeScript development, API integration, and front-end design using CSS, HTML, and JavaScript.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/genietalks/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/genietalks",
        "liveLink": "https://genietalks.vercel.app"
    },
    {
        "title": "atg-world",
        "description": "ATG-World is a personal project showcasing interactive web development skills, built using TypeScript, JavaScript, HTML, and CSS. This repository contains the code for a dynamic website exploring various concepts and functionalities, demonstrating practical application of front-end technologies within the scope of project-based learning.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/atg-world/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/atg-world",
        "liveLink": "https://atg-world-as.vercel.app"
    },
    {
        "title": "jovian",
        "description": "Jovian is a Python-based CRUD application built with Flask and PostgreSQL, providing a practical project for learning web development. Utilizing HTML, CSS, and Python, this repository demonstrates how to create a dynamic web application with database interaction, covering essential topics like CRUD operations, Flask framework usage, and PostgreSQL integration, all deployable and manageable with shell scripting.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/jovian/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/jovian",
        "liveLink": "https://jovian-alpha.vercel.app"
    },
    {
        "title": "Map-Visualisation",
        "description": "This repository, built using HTML and Python, provides a dynamic map visualization project. Leveraging web technologies for the front-end and Python for data processing (if applicable, based on README context), the project aims to display and interact with geographical data on a map. This serves as a practical example of creating interactive data visualizations with a focus on location-based information.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/Map-Visualisation/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/Map-Visualisation",
        "liveLink": "https://map-vis.streamlit.app/"
    },
    {
        "title": "ros-log-viewer",
        "description": "ros-log-viewer is a web-based tool built using JavaScript, Python, HTML, CSS, and Shell scripting for efficiently visualizing and analyzing ROS (Robot Operating System) log files. This project provides a user-friendly interface to filter, search, and explore ROS log data, enabling developers and researchers to quickly identify and troubleshoot issues within their robotic systems.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/ros-log-viewer/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/ros-log-viewer",
        "liveLink": "https://ros-log-viewer-as.vercel.app"
    },
    {
        "title": "finance-with-python",
        "description": "This repository, built with Jupyter Notebook and Python, contains project-based explorations of financial concepts and data analysis. It leverages Python's powerful libraries to analyze financial data, build models, and gain insights into various aspects of finance, making it a valuable resource for learning and applying Python in the financial domain.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/finance-with-python/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/finance-with-python",
        "liveLink": "https://py-finance.streamlit.app/"
    },
    {
        "title": "fruit-seller",
        "description": "Fruit-Seller is a full-stack e-commerce project built with Next.js 14 (using the pages router), TypeScript, and React, leveraging MUI for the UI components and React Query for efficient data fetching and caching. This repository showcases a type-safe approach to building a complete online store experience, encompassing product browsing, shopping cart functionality, and potentially checkout features, demonstrating practical application of modern web development technologies in the context of an e-commerce platform.\n",
        "imgSrc": "https://raw.githubusercontent.com/aayushsiwa/fruit-seller/master/screenshot.png",
        "githubLink": "https://github.com/aayushsiwa/fruit-seller",
        "liveLink": "https://fruit-seller-six.vercel.app"
    }
]